{
//Random Attributes
    "RandomAttribute.1":"valentia",
    "RandomAttribute.2":"ambição",
    "RandomAttribute.3":"curiosidade",
    "RandomAttribute.4":"persistência",

//Random Names
    "RandomName.1":"Johnny",
    "RandomName.2":"Rob",
    "RandomName.3":"Aiden",
    "RandomName.4":"Jim",
	
//Default
    "Default_Qi_spring_Mon": "Gosto de você, garoto. Você mantém o foco em um objetivo e faz acontecer.$2^Gosto de você, garota. Você mantém o foco em um objetivo e faz acontecer.#$b#E é exatamente isso que o torna tão especial.$2^E é exatamente isso que a torna tão especial.",
    "Default_Qi_spring_Tue": "Você faz muitas perguntas, criança.#$e#Você já sabe tudo o que precisa saber sobre mim.",
    "Default_Qi_spring_Wed": "Estou feliz que você está aqui, garoto. Estava começando a ficar entediado.$2^Estou feliz que você está aqui, garota. Estava começando a ficar entediado.", 
    "Default_Qi_spring_Thu": "Lembre-se, criança, nunca deixe seu passado definir o seu futuro.#$b#Tudo o que existe é o que está bem na sua frente.", 
    "Default_Qi_spring_Fri": "Eu costumava ser exatamente como você, garoto. Uma alma livre, os olhos brilhando de emoção e admiração.$2^Eu costumava ser exatamente como você, garota. Uma alma livre, os olhos brilhando de emoção e admiração.#$b#O tempo me mudou; e vai mudar você, também.", 
    "Default_Qi_spring_Sat": "Pode dar uma pausa aqui sempre que quiser relaxar.", 
    "Default_Qi_spring_Sun": "Ainda não terminei com você, garoto...*Heh*$2^Ainda não terminei com você, garota...*Heh*#$e#Tenha paciência, você vai saber quando for o momento certo.", 
    
    "Default_Qi_summer_Mon": "Estive aqui por muito, muito tempo. Mais do que aquele feiticeiro; mais do que o seu avô. Assisti à construção da Vila Pelicanos, tijolo por tijolo, vi pessoas indo e vindo. Observei vidas começarem e terminarem, corações se despedaçando e se consertando aos poucos.#$b#Estive aqui antes de você chegar, e estarei aqui muito depois de você ir, criança.", 
    "Default_Qi_summer_Tue": "Os aldeões estão sempre tão contentes com sua mediocridade. Contentes o bastante para se estabelecer sem nunca tentar alcançar novos horizontes.#$b#Mas você...*Heh*#$b#Um velho homem lhe entrega uma espada, e você não faz perguntas; prende-se firmemente ao seu cabo e desbrava as minas infestadas de monstros. Sem hesitar.#$b#Um bilhete fala para pôr dez beterrabas na geladeira do prefeito, e você o faz, sem sequer saber qual pode ser o resultado.#$b#É como eu venho dizendo, criança, você é especial.", 
    "Default_Qi_summer_Wed": "Nasci um garoto comum, ordinário, mas, ainda jovem, fiz uma decisão: iria me tornar extraordinário.", 
    "Default_Qi_summer_Thu": "A maioria das pessoas não têm legados que irão sobreviver ao tempo, sequer ao seu próprio, e a maioria das pessoas estão felizes dessa forma.#$b#Eu? Nunca estive. E posso dizer que, assim como eu, você também não.", 
    "Default_Qi_summer_Fri": "Nunca pare de buscar pela perfeição.#$e#Nunca contente-se com nada menos do que excelência em tudo o que você faz.", 
    "Default_Qi_summer_Sat": "Todos tem potencial, criança, mas nem todos têm o que é necessário para alcançá-lo.", 
    "Default_Qi_summer_Sun": "Por que você não fica aqui por um tempo, garoto? Sabe, pra fugir um pouco do calor.$2^Por que você não fica aqui por um tempo, garota? Sabe, pra fugir um pouco do calor.",

    "Default_Qi_fall_Mon": "É assim que se faz, garoto. Sinto que você vai se tornar uma estrela.$2^É assim que se faz, garota. Sinto que você vai se tornar uma estrela.#$e#Se precisar de algo, é só me pedir.",
    "Default_Qi_fall_Tue": "Cassinos não seriam tão lucrativos se as pessoas entendessem probabilidade.#$e#Vê aquele homem no caça-níqueis? Ele já está aí há dias.#$b#Ele está certo de que o caça-níqueis vai ser misericordioso a qualquer momento. Mas, claro, é uma máquina. Para ela não existe misericórdia, apenas chance.#$b#E misericórdia não vai ser o suficiente para escapar da cova que ele mesmo cavou.",
    "Default_Qi_fall_Wed": "Imaginei que o veria hoje.$2^Imaginei que a veria hoje.", 
    "Default_Qi_fall_Thu": "Ei. Não fala pra ninguém sobre esse lugar, certo? Quero manter ele... exclusivo.#$e#Você guardaria um segredo do seu amigo Sr. Qi, não guardaria?", 
    "Default_Qi_fall_Fri": "Não pode esconder nada de mim, criança. Escuto sobre cada inseto que você finaliza, cada presente que você dá, tudo o que você planta e cria, cada palavra que sai de sua boca.$1#$b#Você entende, certo?", 
    "Default_Qi_fall_Sat": "Você é esperto, garoto, mas ainda há muito o que aprender, muito o que entender...$2^Você é esperta, garota, mas ainda há muito o que aprender, muito o que entender...", 
    "Default_Qi_fall_Sun": "Algumas coisas nunca mudam, criança.",

    "Default_Qi_winter_Mon": "Não deixe nada ser um resumo de suas ambições, criança. Esse é o motivo de tantos sucumbirem à mediocridade.",
    "Default_Qi_winter_Tue": "Eu sabia que você chegaria aqui algum dia. Claro, tive que dificultar um pouco sua jornada, assim, você teria um incentivo para atingir a excelência.",
    "Default_Qi_winter_Wed": "Porque um cassino?#$b#Nenhum motivo específico, apenas... suprir a oferta para a demanda.", 
    "Default_Qi_winter_Thu": "Você é bem curioso, não é?$2^Você é bem curiosa, não é?", 
    "Default_Qi_winter_Fri": "Ah, @, bem-vindo de volta!$2^Ah, @, bem-vinda de volta!", 
    "Default_Qi_winter_Sat": "Jogos de azar são simplesmente fascinantes.#$b#Tantos invejam aquele que ganha uma bolada na primeira rodada...#$b#Eles não percebem os milhares e milhares que gastam tentando recriar uma jogada de sorte", 
    "Default_Qi_winter_Sun": "Um dia, criança, tudo isso vai fazer sentido. Até lá, continue escalando.#$e#Apenas... tome cuidado para não olhar para baixo. *Heh*",


    "Default_QiNutRoom_spring_Mon": "Esse mundo esconde muito mais do que conseguimos enxergar, criança. Talvez, algum dia, você entenda.#$b#Por agora, apenas continue se esforçando para buscar a excelência em tudo o que você faz.",
    "Default_QiNutRoom_spring_Tue": "A caça às nozes foi, além de um teste da sua força de vontade, uma forma de jogo.#$b#Tenho que admitir, observar você correndo apressadamente pela ilha tem sido bem divertido.",
    "Default_QiNutRoom_spring_Wed": "%Qi está focado nas telas, movendo uma carta de baralho entre seus dedos.#$b#*Heh* {{randomName}} vai querer isso de volta...",
    "Default_QiNutRoom_spring_Thu": "Sua determinação é admirável, criança. Você realmente é especial.",
    "Default_QiNutRoom_spring_Fri": "Mantenha seus olhos na mais distante estrela, e deixe este ser o seu objetivo.#$b#Está sempre ao nosso alcance dar um passo a mais do que acreditávamos conseguir.",
    "Default_QiNutRoom_spring_Sat_true": "Você gosta de jogos, não é, garoto?$2^Você gosta de jogos, não é, garota?#$b#Por que não confere alguns de meus desafios? Podemos fazer um jogo com eles.",
    "Default_QiNutRoom_spring_Sat_false": "Você gosta de jogos, não é, garoto?$2^Você gosta de jogos, não é, garota?#$b#Por que não confere alguns de meus desafios? Podemos fazer um jogo com eles.",
    "Default_QiNutRoom_spring_Sun": "Isso fica entre você e eu, criança, o cassino está mais pra um passatempo;.#$b#Meu trabalho real é aqui.",

    "Default_QiNutRoom_summer_Mon": "Sabe, garoto, você foi o único que conseguiu chegar até aqui.$2^Sabe, garota, você foi a única que conseguiu chegar até aqui.",
    "Default_QiNutRoom_summer_Tue": "Cheguei onde estou agora por pura força de vontade, criança.#$b#Sabe... a mente é uma ferramenta muito poderosa.#$b#De fato, é a ferramenta mais poderosa de todo o universo... e além.",
    "Default_QiNutRoom_summer_Wed": "As telas?#$b#Ah... gosto de ser como um 'guia' para meus amigos, só isso.",
    "Default_QiNutRoom_summer_Thu": "Bem agradável aqui, não acha?",
    "Default_QiNutRoom_summer_Fri": "Você e eu... somos raros, criança.#$b#Grande parte das pessoas não teria se dado o trabalho de procurar por dez nozes, imagine cem.#$b#Mas você? Você vê uma porta e logo quer saber o que há através dela.#$b#Entretanto, suponho que eu não deveria estar surpreso.#$b#Afinal, você nunca foi do tipo que foge de um desafio.",
    "Default_QiNutRoom_summer_Sat_true": "Imagino que você seja bem popular onde você mora, não é?#$b#Claro que é. O humilde fazendeiro que salvou a cidade das garras da ganância corporativa...$2^Claro que é. A humilde fazendeira que salvou a cidade das garras da ganância corporativa...#$b#E quem não ama uma boa e velha história de superação?",
    "Default_QiNutRoom_summer_Sat_false": "Bom, suponho que ninguém poderia acusar você de apostar no cavalo errado.#$b#Faz sentido colocar toda sua fé na gigantesca corporação que tem todos os recursos.#$b#Mesmo que você tenha se mudado para se afastar dela, em primeiro lugar...$1",
    "Default_QiNutRoom_summer_Sun": "Consigo ver o seu potencial, criança. Tudo o que eu quero é que você continue se esforçando para alcançá-lo.#$b#Às vezes, só precisamos de um pequeno empurrãozinho. E essa é a parte que eu entro em cena.",

    "Default_QiNutRoom_fall_Mon": "Tenho uns desafios novos pra você hoje.#$b#Acho que vai gostar.",
    "Default_QiNutRoom_fall_Tue": "Ah, @, que surpresa agradável.#$b#...*Heh* Nah, não foi uma surpresa, nem um pouco.",
    "Default_QiNutRoom_fall_Wed": "Seu avô estaria orgulhoso, @.#$b#Como eu sei disso?...*Heh*#$b#Eu simplesmente sei, garoto, simples assim.$2^Eu simplesmente sei, garota, simples assim.",
    "Default_QiNutRoom_fall_Thu": "Está fazendo um bom trabalho, criança.#$b#Sabe onde me achar se precisar de ajuda.#$b#Claro, não posso simplesmente entregar todas as respostas. Acabaria com a graça.",
    "Default_QiNutRoom_fall_Fri": "Ninguém se torna extraordinário sem alguns sacrifícios, garoto.$2^Ninguém se torna extraordinário sem alguns sacrifícios, garota.#$b#A pergunta é, o que você está disposto a sacrificar?$2^A pergunta é, o que você está disposta a sacrificar?",
    "Default_QiNutRoom_fall_Sat": "Nunca perca sua determinação, criança. Nada vai levar você tão longe como ela.",
    "Default_QiNutRoom_fall_Sun": "Você nunca temeu os riscos, criança. Riscos que ninguém pediu pra você correr.#$b#É assim que eu sei que você é especial.",

    "Default_QiNutRoom_winter_Mon": "Tudo acontece por um motivo, criança.#$b#Você vai entender com o tempo.",
    "Default_QiNutRoom_winter_Tue": "Não perca de vista a pessoa que você busca ser.#$b#Ela sempre vai estar aí; você só tem que alcançá-la.",
    "Default_QiNutRoom_winter_Wed": "O poder é uma ilusão medíocre, garoto.$2^O poder é uma ilusão medíocre, garota.#$b#Ele não existiria se ninguém acreditasse nele. O título de prefeito de Lewis não tem nenhum significado além daquele que você mesmo atribui.#$b#Quando você entender isso, vai aprender a controlar a ilusão.",
    "Default_QiNutRoom_winter_Thu": "O mundo não para de mudar, criança.#$b#Marés ascendem e caem, a lua cresce e diminui, milênios virão e mudarão o vale completamente...#$b#Mas eu me mantenho constante.",
    "Default_QiNutRoom_winter_Fri": "Como é o clima no seu lar, criança?#$b#Aqui mesmo é quente e agradável.",
    "Default_QiNutRoom_winter_Sat_true": "O medo é o inimigo do esplêndido, garoto.$2^O medo é o inimigo do esplêndido, garota.#$b#Tantos temem a chance de estragar tudo, que sequer tentam.#$b#Estes preferem se contentar com onde estão do que apostar no desconforto da mudança.",
    "Default_QiNutRoom_winter_Sat_false": "O medo é o inimigo do esplêndido, garoto.$2^O medo é o inimigo do esplêndido, garota.#$b#Tantos temem a chance de estragar tudo, que sequer tentam.#$b#Estes preferem se contentar com onde estão do que apostar no desconforto da mudança.",	
    "Default_QiNutRoom_winter_Sun": "Não esqueça de conferir o quadro amanhã.#$b#Nunca se sabe o que se pode encontrar.",


    "MxQi_fall_Thu": "Ei. Não fala pra ninguém sobre esse lugar, beleza? Quero manter ele... exclusivo.#$e#Você guardaria um segredo para mim, não guardaria?", 
    "MxQi_summer_Wed": "Nasci alguém comum, ordinário, mas, ainda jovem, fiz uma decisão: iria me tornar uma pessoa extraordinária.",

    "spring_MxQi_NutRoom_Wed": "%Qi está observando as telas, movendo uma carta de baralho entre seus dedos.#$b#*Heh* {{randomName}} vai querer isso de volta...",

//Skull Cavern 25
    "ChallengeComplete_Qi_spring_Mon":"Você é surpreendente, criança.#$b#Não esperava que você fosse chegar até aqui.",
    "ChallengeComplete_Qi_spring_Tue":"Se machucar faz parte da vida, criança. O mundo vai te derrubar, independente de sua vontade.#$b#O objetivo não é nunca se machucar; é superar as feridas, e retornar ainda mais forte.",
    "ChallengeComplete_Qi_spring_Wed":"Não pode fugir dos riscos para sempre, criança.#$b#Você não tem escolha se vai ou não se encontrar à beira do abismo, prestes a perder tudo.#$b#A pergunta é: esse momento... vai significar algo para você?#$b#Vai ter sido uma escolha, ou simplesmente onde os ventos do destino o trouxeram?$2^Vai ter sido uma escolha, ou simplesmente onde os ventos do destino a trouxeram?",
    "ChallengeComplete_Qi_spring_Thu":"Aliás, como anda o feiticeiro?#$b#Faz bastante tempo que não nos falamos.#$e#Sim, criança, eu o conhecia.#$b#Nós tivemos um pequeno... desentendimento, por assim dizer.$1",
    "ChallengeComplete_Qi_spring_Fri":"Olhe à sua volta, criança.#$b#Cada pessoa aqui veio pensando que iria sair melhor do que antes.#$b#Nenhum deles o fez.#$e#Chamamos isso de falácia do apostador.#$b#É a razão de tantos se prenderem num hábito.#$b#É a brecha na gaiola, a falsa sensação de segurança, pronta para te esmagar no menor dos deslizes.",
    "ChallengeComplete_Qi_spring_Sat":"Uma coisa é ser fraco fisicamente. Se souber improvisar com com o que tem, nada vai lhe impedir de alcançar a excelência. Mas mentalmente?#$b#Se você carece de força no psicológico, força bruta não vai significar absolutamente nada.#$b#É tudo sobre vontade, criança. Todo o resto é alcançado indiretamente.",
    "ChallengeComplete_Qi_spring_Sun":"Ainda existe muito que você não sabe, criança, e mais ainda que você não entende.#$b#Mas você continua seguindo em frente apesar de tudo. Eu respeito isso.",

    "ChallengeComplete_Qi_summer_Mon":"Nunca subestime o poder de sua mente, garoto.$2^Nunca subestime o poder de sua mente, garota.#$b#É a sua arma mais poderosa.",
    "ChallengeComplete_Qi_summer_Tue":"Coragem não é o oposto de medo, garoto. É sentir medo e, mesmo assim, continuar avançando.$2^Coragem não é o oposto de medo, garota. É sentir medo e, mesmo assim, continuar avançando.",
    "ChallengeComplete_Qi_summer_Wed":"Não tenho paciência para pessoas que inventam desculpas para si mesmas.#$b#Tudo se resume à falta de força de vontade; qualquer explicação adicional e elas estão simplesmente gastando fôlego.$1",
    "ChallengeComplete_Qi_summer_Thu":"Segurança é simples, criança. É confortável, mas insignificante.#$b#Tudo o que diz sobre você é que sabe evitar o perigo, o que nem sempre é uma coisa positiva.$1",
    "ChallengeComplete_Qi_summer_Fri":"Você não foi a primeira pessoa que chamou minha atenção, criança.#$b#Os outros?#$b#Digamos que, no final, não eram exatamente do jeito que eu esperava.$1",
    "ChallengeComplete_Qi_summer_Sat":"Sabe a diferença entre covardia e medo, garoto?$2^Sabe a diferença entre covardia e medo, garota?#$e#O medo é um sentimento, um instinto básico que adquirimos para nos manter vivos antes mesmo de termos uma casa para morar e lojas para comprar nosso alimento.#$b#Covardia, entretanto, é uma escolha.#$b#A escolha de que você iria pela rota mais fácil e deixaria seu medo controlar, do que exercer a força de vontade necessária para passar por ela.",
    "ChallengeComplete_Qi_summer_Sun":"Ambição não é simplesmente ter objetivos, criança. Também é ter a força de seguir, lutar por eles.#$b#É aí que tantos falham.#$b#Um objetivo sem determinação é apenas um desejo, e um desejo... não vale nada.",

    "ChallengeComplete_Qi_fall_Mon":"Sabe o que faz da mediocridade tão frustrante, criança?#$b#É o que ela representa. Tanto potencial desperdiçado, uma faísca impedida de acender uma fogueira, por medo de incendiar o mundo.#$b#Mas, às vezes, é necessário acender a chama.",
    "ChallengeComplete_Qi_fall_Tue":"Nem sempre os monstros estiveram confinados às minas, criança. O vale nem sempre foi tão perfeito, acolhedor e delicado quanto agora.#$b#Claro, tudo o que conquistaram ao trancafiar os monstros está fazendo com que sejam esquecidos.#$b#Cria uma sensação de segurança, com certeza, mas o que acontece quando essa segurança acabar?",
    "ChallengeComplete_Qi_fall_Wed":"Você nunca deixa de me impressionar, criança.#$b#Não é o tempo todo que alguém supera minhas expectativas de forma tão consistente.",
    "ChallengeComplete_Qi_fall_Thu":"Quando você conquista as coisas que eu conquistei, é fácil se decepcionar quando as pessoas não mostram nenhum interesse em alcançar o seu verdadeiro potencial.$1",
    "ChallengeComplete_Qi_fall_Fri":"O tipo de ambição que o faz poderoso é diferente daquela que o faz grandioso.$2^O tipo de ambição que a faz poderosa é diferente daquela que a faz grandiosa.#$b#Uma foca em aperfeiçoar o que você adquiriu, a outra foca em aperfeiçoar a si mesmo.$2^Uma foca em aperfeiçoar o que você adquiriu, a outra foca em aperfeiçoar a si mesma.",
    "ChallengeComplete_Qi_fall_Sat":"Complacência é a inimiga do progesso, criança.#$b#Muito potencial é desperdiçado em alguém 'perfeitamente feliz' mesmo onde está.$1",
    "ChallengeComplete_Qi_fall_Sun":"Uma das maiores armadilhas que inventamos é se prender tanto à vergonha de nossos próprios medos que nunca vamos nos dar uma oportunidade de superar eles.",

    "ChallengeComplete_Qi_winter_Mon":"Normalmente, as pessoas tentam ganhar maiores recompensas pelos menores riscos.#$b#O que eles falham em entender é que metade da recompensa é proveniente do próprio risco. As lições aprendidas, a experiência conquistada.#$b#Pessoas não são tão boas em reconhecer recompensas que não são tangíveis.#$b#Bom, é compreensível, eu suponho.",
    "ChallengeComplete_Qi_winter_Tue":"Sua coragem é admirável, criança.#$b#A maioria das pessoas sequer teriam entrado na Caverna da Caveira, sequer teriam ficado, e sequer adentrariam seus níveis.",
    "ChallengeComplete_Qi_winter_Wed":"O que você tem que entender, criança, é que a segurança é uma ilusão.#$b#Não existe uma forma de realmente garantir a segurança.#$b#É como uma hidra. Você corta um perigo, e mais dois crescem em seu lugar.",
    "ChallengeComplete_Qi_winter_Thu":"Até mesmo as mais fracas mentes têm mais poder do que os mais fortes músculos.#$b#O seu braço pode apenas brandir sua lâmina quando sua mente o guia a fazê-lo.#$b#Sua mente é aquela que decide usar a espada, e também a que supera o mais básico medo.#$b#A sua mente, garoto, nunca a subestime.$2^A sua mente, garota, nunca a subestime.",
    "ChallengeComplete_Qi_winter_Fri":"Você fez mais em {{months}} meses do que a maioria das pessoas fizeram em toda sua vida. Isso é motivo de orgulho, criança.#$b#Só... não use esse orgulho como desculpa para parar de seguir em frente.",
    "ChallengeComplete_Qi_winter_Sat":"Tenho certeza de que você está familiarizado com o efeito Dunning-Kruger.$2^Tenho certeza de que você está familiarizada com o efeito Dunning-Kruger.#$b#Uma pequena, boba tendência a qual os humanos têm de se acharem profissionais quando na verdade são incompetentes, e de acharem que são incompetentes quando na verdade são profissionais.#$e#Essa é só mais uma das formas na qual a percepção falha.#$b#É até interessante quando você consegue identificá-los. Gosto de tratar isso como um pequeno jogo.",
    "ChallengeComplete_Qi_winter_Sun":"Lembre-se, criança, mesmo que você esteja apenas um passo acima da mediocridade, você ainda está no caminho certo.",


    "ChallengeComplete_QiNutRoom_spring_Mon":"Olá. Tenho alguns desafios novos pra você, garoto.$2^Olá. Tenho alguns desafios novos pra você, garota.",
    "ChallengeComplete_QiNutRoom_spring_Tue":"Estou surpreendido que conseguiu chegar aqui tão cedo.#$b#Suponho que o clima aqui é bem mais misericordioso do que no deserto, não é?",
    "ChallengeComplete_QiNutRoom_spring_Wed":"Percebo que talvez eu tenha o subestimado, garoto.$2^Percebo que talvez eu tenha a subestimado, garota.#$b#Vou ficar de olho em você.",
    "ChallengeComplete_QiNutRoom_spring_Thu":"Você carrega consigo uma mente grandiosa, criança.#$b#Se você continuar assim, sei que vai chegar longe.",
    "ChallengeComplete_QiNutRoom_spring_Fri":"Gosto de você, garoto, mas isso não significa que vou te deixar em paz.$2^Gosto de você, garota, mas isso não significa que vou te deixar em paz.#$b#Quero ver você evoluir, superar a si mesmo. Sei que consegue.$2^Quero ver você evoluir, superar a si mesma. Sei que consegue.",
    "ChallengeComplete_QiNutRoom_spring_Sat":"Uma coisa é ser fraco fisicamente. Se souber improvisar com com o que tem, nada vai lhe impedir de alcançar a excelência. Mas mentalmente?#$b#Se você carece de força no psicológico, força bruta não vai significar absolutamente nada.#$b#É tudo sobre vontade, criança. Todo o resto é alcançado indiretamente.",
    "ChallengeComplete_QiNutRoom_spring_Sun":"Respeito sua persistência, garoto.$2^Respeito sua persistência, garota.",

    "ChallengeComplete_QiNutRoom_summer_Mon":"A ilha fica um pouco úmida nessa época do ano. A maioria das pessoas acha isso um pouco desconcertante.#$b#Você é estranho, garoto.$2^Você é estranha, garota.",
    "ChallengeComplete_QiNutRoom_summer_Tue":"Não há muito o que eu não saiba, criança.#$b#São apenas observações comuns, sério.#$b#Você se surpreenderia com o que pode descobrir sobre alguém simplesmente por estar prestando atenção.",
    "ChallengeComplete_QiNutRoom_summer_Wed":"Sempre mantive olhos abertos para as pessoas que me interessam.#$b#A maioria deles nunca descobriu.",
    "ChallengeComplete_QiNutRoom_summer_Thu":"Meu cassino costuma atrair pessoas que confiam na sua própria sorte, procurando por um caminho mais fácil.#$b#Nunca encontram tal caminho, claro, e não finjo acreditar que vão encontrar.#$b#Mas continuam voltando, apesar de tudo.",
    "ChallengeComplete_QiNutRoom_summer_Fri":"É sempre bom pensar sobre o futuro, garoto.$2^É sempre bom pensar sobre o futuro, garota.#$b#Só não se perca tanto nesses pensamentos a ponto de esquecer de agir no presente.",
    "ChallengeComplete_QiNutRoom_summer_Sat":"Existem muito mais monstros por aí.#$b#As minas foram só o começo.",
    "ChallengeComplete_QiNutRoom_summer_Sun":"Fique atento, garoto.$2^Fique atenta, garota.#$b#Confiança é uma coisa boa, mas perigosa quando ela o controla e não o contrário.$2^Confiança é uma coisa boa, mas perigosa quando ela a controla e não o contrário.",

    "ChallengeComplete_QiNutRoom_fall_Mon":"Não há nenhuma certeza na vida.#$b#Mas não se assuste com isso, criança. É simplesmente como as coisas funcionam.",
    "ChallengeComplete_QiNutRoom_fall_Tue":"Você está se saindo bem, criança.#$b#Mas eu quero ver você se sair melhor ainda.",
    "ChallengeComplete_QiNutRoom_fall_Wed":"Digamos que não tenho uma boa conexão com os outros habitantes da ilha.#$b#Entretanto, temos um certo tratado não oficial: Eles não entram no meu caminho, e eu não entro no caminho deles.",
    "ChallengeComplete_QiNutRoom_fall_Thu":"Está vendo aquele vulcão? Vi muitas pessoas entrarem lá.#$b#Porém... não vi muitos saírem.",
    "ChallengeComplete_QiNutRoom_fall_Fri":"Sinceramente, não me importo muito com o clima.#$b#Tenho vários modos de garantir que aqui dentro fique mais agradável.",
    "ChallengeComplete_QiNutRoom_fall_Sat":"Já sentiu como se o único motivo pelo qual você chegou tão longe foi pura sorte?#$b#Por favor, nem sempre dá para confiar na sorte. Dê um pouco de crédito para si mesmo.$2^Por favor, nem sempre dá para confiar na sorte. Dê um pouco de crédito para si mesma.",
    "ChallengeComplete_QiNutRoom_fall_Sun":"Vou ter alguns desafios novos para você amanhã, criança.#$b#Tenho certeza de que vai gostar.",

    "ChallengeComplete_QiNutRoom_winter_Mon":"Você está cada vez mais perto de se tornar a pessoa a qual é destinado a ser.$2^Você está cada vez mais perto de se tornar a pessoa a qual é destinada a ser.",
    "ChallengeComplete_QiNutRoom_winter_Tue":"O tempo todo, as pessoas definem para si mesmas metas tão altas que vão se sentir sobrecarregadas só de pensar.#$b#Assim, por estar tão distante, nunca vão agir para alcançá-la, como se ficar esperando sentado fosse ajudar em alguma coisa.#$b#Nunca ajuda. Você tem que ter atitude, criança.",
    "ChallengeComplete_QiNutRoom_winter_Wed":"O mundo está sempre mudando, criança. A cada segundo, cada século.#$b#Mesmo se você se sentir estagnado, o mundo à sua volta nunca para.",
    "ChallengeComplete_QiNutRoom_winter_Thu":"A caverna do vulcão é perigosa, mas tem apenas dez andares.#$b#O truque é, em vez de descer, você sobe.#$b#Se decidir tentar, boa sorte.",
    "ChallengeComplete_QiNutRoom_winter_Fri":"Continue assim, garoto.$2^Continue assim, garota.#$b#Tenho grandes expectativas por você. Não me decepcione agora.",
    "ChallengeComplete_QiNutRoom_winter_Sat":"Você tem o necessário para alcançar o que você quiser, criança.",
    "ChallengeComplete_QiNutRoom_winter_Sun":"E aí? Tomando um solzinho?",
     
 
//100 Skull Cavern
    "SkullCave_Qi_spring_Mon":"Por um bom tempo, estava preocupado em ter apostado no cavalo errado.#$b#Estou feliz de ver você provando que eu estava errado.",
    "SkullCave_Qi_spring_Tue":"Você nunca foi do tipo que deixa uma porta trancada o parar, não é?$2^Você nunca foi do tipo que deixa uma porta trancada a parar, não é?#$b#Não, onde outros vêem um obstáculo, você vê uma oportunidade.",
    "SkullCave_Qi_spring_Wed":"A Caverna da Caveira é considerada um dos lugares mais perigosos do vale.#$b#A maioria das pessoas não entrariam nela nem por um milhão em ouro.",
    "SkullCave_Qi_spring_Thu":"Tenho olhos em todos os lugares, criança.#$b#O que posso dizer? Gosto de acompanhar o caminho das pessoas que me interessam.",
    "SkullCave_Qi_spring_Fri":"Alcançar a honra não é fácil, garoto. Se fosse, todos seriam honrados.$2^Alcançar a honra não é fácil, garota. Se fosse, todos seriam honrados.",
    "SkullCave_Qi_spring_Sat":"Você tem ambição, criança. E o tipo certo, também.#$b#Só isso já o coloca muito à frente dos outros.$2^Só isso já a coloca muito à frente dos outros.",
    "SkullCave_Qi_spring_Sun":"Nunca para de escalar, criança.#$b#Quando atinge um objetivo, procure um novo, e vá atrás dele.",

    "SkullCave_Qi_summer_Mon":"Você nunca conhece alguém de verdade até vê-lo com medo, criança.#$b#A decisão de fugir ou lutar vai dizer tudo o que você precisa saber.",
    "SkullCave_Qi_summer_Tue":"Qualquer um pode definir um objetivo, criança, mas não serve de nada se você não lutar por ele.",
    "SkullCave_Qi_summer_Wed":"Nunca deixe as opiniões dos outros o impedir de alcançar o que você busca.$2^Nunca deixe as opiniões dos outros a impedir de alcançar o que você busca.#$b#Não importa o que pensam de você; todos parecem formigas daqui de cima.",
    "SkullCave_Qi_summer_Thu":"Muitas pessoas tem tanto medo de cair que sequer tentam escalar.#$b#Passam suas vidas tentando se manter longe de perigos.#$b#Mas morrem de qualquer forma, com uma vida que, no final, não significou nada.",
    "SkullCave_Qi_summer_Fri":"Continue assim, criança. Estou torcendo por você.#$b#Você não quer me decepcionar, quer?",
    "SkullCave_Qi_summer_Sat":"Suponho que sua ousadia não deveria me surpreender.#$b#Desde o momento em que saiu daquele ônibus, estava claro, deixando para trás tudo que conhecia — seus amigos, seu lar, seu trabalho — por um terreno coberto de vegetação e uma pequena casa com apenas um quarto...#$b#Você nunca deu as costas para um desafio, não é mesmo?",
    "SkullCave_Qi_summer_Sun":"As pessoas costumam alegar não ter ambições, criança. Falam com firmeza de como são determinadas, mas no momento que as coisas começam a ficar difíceis? Repentinamente, estão perfeitamente satisfeitas do jeito que estão.",

    "SkullCave_Qi_fall_Mon":"Arrumar desculpas é o jeito mais rápido de garantir que você nunca vai conquistar nada, criança.#$b#Quanto mais cedo perceber isso, melhor você vai estar.",
    "SkullCave_Qi_fall_Tue":"Quando eu era apenas um garoto, percebi que o medo só iria me atrapalhar.#$b#Então aprendi sozinho a controlar o medo até o ponto em que eu sequer o sentia.",
    "SkullCave_Qi_fall_Wed":"Ei, criança, deixe-me perguntar algo.#$b#$y Quem você acredita ser a pessoa mais poderosa do vale?_Prefeito Lewis._Ah, tão inocente. Não._O Feiticeiro._Um palpite compreensível, mas não, não é ele._Você?_*Heh*Fico lisonjeado, @.#$b#Lembre-se, criança, o poder existe apenas onde afirmamos existir.",
    "SkullCave_Qi_fall_Thu":"Existem milhões de possibilidades por aí, criança.#$b#Muitos ficam em cima do muro ao decidir qual delas buscar. Nunca param para pensar se sequer precisam escolher.",
    "SkullCave_Qi_fall_Fri":"Eu sabia o que queria da vida desde muito jovem.#$e#O que eu queria?#$b#*Heh* Tudo, garoto.$2^*Heh* Tudo, garota.",
    "SkullCave_Qi_fall_Sat":"Jogos de azar são um risco pelo qual nem todos sentem aversão.#$b#Não é necessário se dedicar de verdade, sabe? Só se sentar na frente de uma máquina e apertar um botão até dar sorte.#$b#É um negócio que vende bem nesse sentido.",
    "SkullCave_Qi_fall_Sun":"Gosto de saber sobre as pessoas. Seus sonhos, seus medos, o que amam e o que odeiam.#$b#Quando o faz, pode começar a ser uma influência para elas. Você sabe o que as faz funcionar.",

    "SkullCave_Qi_winter_Mon":"Está satisfeito com sua vida atual, garoto? Se tudo se mantivesse exatamente como está agora, você estaria feliz?$2^Está satisfeita com sua vida atual, garota? Se tudo se mantivesse exatamente como está agora, você estaria feliz?#$b#Espero que não. Eu ficaria decepcionado se você estivesse satisfeito com um legado tão escasso.$2^Espero que não. Eu ficaria decepcionado se você estivesse satisfeita com um legado tão escasso.",
    "SkullCave_Qi_winter_Tue":"Sabe, criança, aquela porta estava trancada por um motivo.#$b#Mas não precisa se preocupar com isso. *Hehe*",
    "SkullCave_Qi_winter_Wed":"Gosto de me imaginar como um comerciante de riscos.#$b#Prometa que eles podem ganhar uma fortuna, tudo por um pouco de ouro... então, um pouco mais... e um pouco mais...#$b#*Heh* E ainda assim, vão estar nas suas mãos, mesmo que seu mundo esteja sucumbindo à sua volta.",
    "SkullCave_Qi_winter_Thu":"Como eu sabia que você tinha entrado na caverna?#$b#Não há nada que, eventualmente, não chegue aos meus ouvidos.",
    "SkullCave_Qi_winter_Fri":"Claro que alcançar a excelência é difícil, criança. Todos seriam formidáveis se fosse fácil, mas isso não diria nada sobre eles.",
    "SkullCave_Qi_winter_Sat":"Tente não perder sua {{randomAttribute}}, criança.#$b#É o seu bem mais valioso.",
    "SkullCave_Qi_winter_Sun":"Você deixou sua vida para trás em busca de um sonho, e, agora, aqui está você.#$b#Como se sente com isso, garoto?$2^Como se sente com isso, garota?",


    // "SkullCave_QiNutRoom_spring_Mon":"",
    // "SkullCave_QiNutRoom_spring_Tue":"",
    // "SkullCave_QiNutRoom_spring_Wed":"",
    // "SkullCave_QiNutRoom_spring_Thu":"",
    // "SkullCave_QiNutRoom_spring_Fri":"",
    // "SkullCave_QiNutRoom_spring_Sat":"",
    // "SkullCave_QiNutRoom_spring_Sun":"",

    // "SkullCave_QiNutRoom_summer_Mon":"",
    // "SkullCave_QiNutRoom_summer_Tue":"",
    // "SkullCave_QiNutRoom_summer_Wed":"",
    // "SkullCave_QiNutRoom_summer_Thu":"",
    // "SkullCave_QiNutRoom_summer_Fri":"",
    // "SkullCave_QiNutRoom_summer_Sat":"",
    // "SkullCave_QiNutRoom_summer_Sun":"",

    // "SkullCave_QiNutRoom_fall_Mon":"",
    // "SkullCave_QiNutRoom_fall_Tue":"",
    // "SkullCave_QiNutRoom_fall_Wed":"",
    // "SkullCave_QiNutRoom_fall_Thu":"",
    // "SkullCave_QiNutRoom_fall_Fri":"",
    // "SkullCave_QiNutRoom_fall_Sat":"",
    // "SkullCave_QiNutRoom_fall_Sun":"",

    // "SkullCave_QiNutRoom_winter_Mon":"",
    // "SkullCave_QiNutRoom_winter_Tue":"",
    // "SkullCave_QiNutRoom_winter_Wed":"",
    // "SkullCave_QiNutRoom_winter_Thu":"",
    // "SkullCave_QiNutRoom_winter_Fri":"",
    // "SkullCave_QiNutRoom_winter_Sat":"",
    // "SkullCave_QiNutRoom_winter_Sun":"",

    "SkullCave_MxQi_fall_Tue":"Quando eu era apenas uma criança, percebi que o medo só iria me atrapalhar.#$b#Então, aprendi a controlar o medo até o ponto em que eu sequer o sentia.",

//Enchanted Grove
    "EG_Qi_spring_Mon":"Você dominou magias que muitos sequer compreenderiam.#$b#Você realmente é especial, garoto.$2^Você realmente é especial, garota.",
    "EG_Qi_spring_Tue":"Só... tome cuidado, garoto...$2^Só... tome cuidado, garota...#$b#Odiaria ter que considerar você uma ameaça.#$e#*Hehe* Estou apenas brincando contigo.#$e#%Você sente que ele não acha nem um pouco de graça nisso tudo.",
    "EG_Qi_spring_Wed":"Se está se sentido sortudo, porque não dá uma chance pra um dos jogos?$2^Se está se sentido sortuda, porque não dá uma chance pra um dos jogos?",
    "EG_Qi_spring_Thu":"Como eu disse, você já sabe tudo o que precisa saber sobre mim.",
    "EG_Qi_spring_Fri":"E aqui está @.#$e#Bem-vindo de volta, garoto.$2^Bem-vinda de volta, garota.",
    "EG_Qi_spring_Sat":"Eu, particularmente, nunca tento jogar nenhum dos jogos aqui.#$e#Não tem graça quando você já sabe como ganhar.",
    "EG_Qi_spring_Sun":"Lembra de quando eu falei sobre como o tempo ia mudar você?#$e#Esse é o caso agora, garoto.$2^Esse é o caso agora, garota.",

    "EG_Qi_summer_Mon":"Você está longe do ordinário, criança.#$b#Eu sabia desde o momento que o vi, mas você não para de provar isso.$2^Eu sabia desde o momento que a vi, mas você não para de provar isso.",
    "EG_Qi_summer_Tue":"Não tenha medo da mudança.#$b#Afinal, mudança é exatamente o que o trouxe até aqui.$2^Afinal, mudança é exatamente o que a trouxe até aqui.",
    "EG_Qi_summer_Wed":"Isso fica entre eu e você, garoto, vê aquele negociante?$2^Isso fica entre eu e você, garota, vê aquele negociante?#$b#Eu e ele não temos exatamente as mesmas opiniões sobre muitas coisas.$1#$e#Mantenho ele por perto porque é útil, e interessante, mas se não fosse assim...$1",
    "EG_Qi_summer_Thu":"Sandy é uma boa garota.#$b#Pago ela pelo espaço; e ela não faz perguntas.#$e#É uma troca justa, não acha?",
    "EG_Qi_summer_Fri":"Porque não fica por um tempo, garoto? Aproveite a sombra enquanto pode.$2^Porque não fica por um tempo, garota? Aproveite a sombra enquanto pode.#$e#Você não está com pressa, está?",
    "EG_Qi_summer_Sat":"Você me lembra de mim mesmo quando eu era mais jovem, garoto.$2^Você me lembra de mim mesmo quando eu era mais jovem, garota.#$b#Isso foi há muito, muito tempo atrás. Não há muito o que falar sobre isso.",
    "EG_Qi_summer_Sun":"Estou feliz que você está aderindo aos meus conselhos, criança.#$b#Nunca pare de buscar pela perfeição...#$e#Claro que notei.",

    "EG_Qi_fall_Mon":"Ainda somos amigos, não é, garoto?$2^Ainda somos amigos, não é, garota?#$e#Ótimo. Estou confiando muito em você, o deixando vir até aqui.$2^Ótimo. Estou confiando muito em você, a deixando vir até aqui.",
    "EG_Qi_fall_Tue":"*Heh* Você está aprendendo, criança.#$e#Ainda falta um bom tempo para saber sobre tudo, mas... você está aprendendo.",
    "EG_Qi_fall_Wed":"Sabe, rigorosamente falando, apenas magos de alto nível são permitidos criar um Nexus, e você é...#$b#Sem ofensa, criança, mas, considerando tudo o que os magos representam, você não é exatamente um dos melhores.#$e#Mas, por sorte, consegui mexer os pauzinhos para ajudar você com essa parte.",
    "EG_Qi_fall_Thu":"Não pense que já acabou, criança.#$e#*Heh* Você está apenas começando.",
    "EG_Qi_fall_Fri":"Você cresceu bastante nesses últimos anos, e mesmo assim, de alguma forma, você não mudou nem um pouco.",
    "EG_Qi_fall_Sat":"Como eu disse, acho que você vai se tornar uma estrela.#$e#Eu diria para você me falar caso precisasse de alguma coisa, mas...#$b#*Heh* Olha só pra você. Mal precisa de minha ajuda, não é mesmo?",
    "EG_Qi_fall_Sun":"Rasmodeu e eu não concordamos com muitas coisas. Especialmente sobre você.#$e#Ele prefere manter você em segurança; Eu prefiro apoiar sua evolução.",

    "EG_Qi_winter_Mon":"A magia do transporte não é algo a se desdenhar, criança.#$e#A maioria dos magos apenas a aprendem após anos de estudo e prática.#$b#Ainda assim, está longe de ser a magia mais poderosa.",
    "EG_Qi_winter_Tue":"Imagino quais tipos de magias o Rasmodeu vai ensinar para você.#$b#Talvez as divinas...?",
    "EG_Qi_winter_Wed":"Você me impressiona, garoto. Sério.$2^Você me impressiona, garota. Sério.#$e#Mas isso não significa que não quero ver o que mais você tem a oferecer.",
    "EG_Qi_winter_Thu":"Você aprende bem mais sobre alguém quando vê sua luta e seu esforço, do que quando recebem resultados imediatos em tudo.#$e#E, cá entre nós, pessoas que sempre recebem resultados imediatos não são de tentar muito.",
    "EG_Qi_winter_Fri":"Você é determinado, garoto.$2^Você é determinada, garota.#$b#Gosto disso em você. Nunca se dá por vencido.$2^Gosto disso em você. Nunca se dá por vencida.",
    "EG_Qi_winter_Sat":"Como está o seu Nexus, criança?#$b#Está tudo indo como você esperava?#$e#Ótimo. Imagino que você vai usá-los com mais frequência, em breve.",
    "EG_Qi_winter_Sun":"Continue assim, garoto.$2^Continue assim, garota.#$b#Você está no caminho certo para alcançar a excelência.",

    "EG_MxQi_spring_Tue":"Só... tome cuidado, garoto...$2^Só... tome cuidado, garota...#$b#Odiaria ter que considerar você uma ameaça.#$e#*Haha* Estou apenas brincando contigo.#$e#%Você sente que Qi não acha nem um pouco de graça nisso tudo.",


    // "EG_QiNutRoom_spring_Mon":"",
    // "EG_QiNutRoom_spring_Tue":"",
    // "EG_QiNutRoom_spring_Wed":"",
    // "EG_QiNutRoom_spring_Thu":"",
    // "EG_QiNutRoom_spring_Fri":"",
    // "EG_QiNutRoom_spring_Sat":"",
    // "EG_QiNutRoom_spring_Sun":"",

    // "EG_QiNutRoom_summer_Mon":"",
    // "EG_QiNutRoom_summer_Tue":"",
    // "EG_QiNutRoom_summer_Wed":"",
    // "EG_QiNutRoom_summer_Thu":"",
    // "EG_QiNutRoom_summer_Fri":"",
    // "EG_QiNutRoom_summer_Sat":"",
    // "EG_QiNutRoom_summer_Sun":"",

    // "EG_QiNutRoom_fall_Mon":"",
    // "EG_QiNutRoom_fall_Tue":"",
    // "EG_QiNutRoom_fall_Wed":"",
    // "EG_QiNutRoom_fall_Thu":"",
    // "EG_QiNutRoom_fall_Fri":"",
    // "EG_QiNutRoom_fall_Sat":"",
    // "EG_QiNutRoom_fall_Sun":"",

    // "EG_QiNutRoom_winter_Mon":"",
    // "EG_QiNutRoom_winter_Tue":"",
    // "EG_QiNutRoom_winter_Wed":"",
    // "EG_QiNutRoom_winter_Thu":"",
    // "EG_QiNutRoom_winter_Fri":"",
    // "EG_QiNutRoom_winter_Sat":"",
    // "EG_QiNutRoom_winter_Sun":"",

//Badlands - NEW 
    "Badlands_Qi_spring_Mon":"Então, a Camilla realmente...#$b#Heh.",
    "Badlands_Qi_spring_Tue":"A Vila do Castelo tem alguns dos melhores aventureiros do mundo.#$b#Tenho certeza de que você já ouviu tudo sobre isso a esse ponto.",
    "Badlands_Qi_spring_Wed":"Sandy está fazendo um bom trabalho ao não se meter em meus negócios.#$b#Eu não tentaria mudar isso, se fosse você.$1",
    "Badlands_Qi_spring_Thu":"E aí, garoto. Veio aqui jogar algumas partidas?$2^E aí, garota. Veio aqui jogar algumas partidas?#$e#Aposto que esses caras estão ansiosos para jogar umas rodadas de Calico Jack com um aventureiro ilustre como você.$2^Aposto que esses caras estão ansiosos para jogar umas rodadas de Calico Jack com uma aventureira ilustre como você.",
    "Badlands_Qi_spring_Fri":"Claro que eu sabia sobre o Deserto Carmesim, criança.#$e#Por acaso você pensou que algo como isso não passaria pelo meu radar?",
    "Badlands_Qi_spring_Sat":"Você tem honra, garoto.$2^Você tem honra, garota.#$b#Defenda-a com firmeza.",	
    "Badlands_Qi_spring_Sun":"Não se esqueça de onde você veio, criança.#$b#Você cresceu, e vai continuar crescendo.",

    "Badlands_Qi_summer_Mon":"Você deve ser habilidoso em combate se a Camilla o trouxe para lutar por ela.$2^Você deve ser habilidosa em combate se a Camilla a trouxe para lutar por ela.#$e#Bom, isso, ou ela está desesperada. De qualquer forma.",
    "Badlands_Qi_summer_Tue":"O pessoal daqui não é muito de se aventurar.#$e#É um pouco irônico, não acha?#$b#Seria esperado pensar que apostadores estariam interessados em brincar com os riscos.",
    "Badlands_Qi_summer_Wed":"Tenho certeza que você já sabe quase tudo sobre o povo da cidade a esse ponto, não é?",
    "Badlands_Qi_summer_Thu":"Tente não morrer lá fora, criança.$1#$e#Sabe o que acontece com os aventureiros que caem no Deserto Carmesim?$1#$b#Seria uma pena se isso acontecesse com você.$1",
    "Badlands_Qi_summer_Fri":"Já viu uma serpente corrompida, criança?#$b#Fique atento aos seus arredores; vão atacar furtivamente na primeira oportunidade, se você não for cuidadoso.$1^Fique atenta aos seus arredores; vão atacar furtivamente na primeira oportunidade, se você não for cuidadosa.$1",
    "Badlands_Qi_summer_Sat":"Sua identidade própria é importante, mas não deixe que isso o mantenha estagnado.$2^Sua identidade própria é importante, mas não deixe que isso a mantenha estagnada.#$e#Toda evolução é uma boa evolução, mesmo que, por causa dela, você mude completamente.",
    "Badlands_Qi_summer_Sun":"Aposto que você está se perguntando o que eu estou procurando aqui, não está?#$e#Nada que você precise se preocupar. Você está indo bem, criança.",

    "Badlands_Qi_fall_Mon":"Camilla é uma das mais poderosas usuárias de magia do mundo inteiro.#$b#Mas ela é teimosa.$1#$b#Nós discordamos em diversos assuntos.",
    "Badlands_Qi_fall_Tue":"É incrível, não é?#$b#Como uma simples e mundana decisão pode alterar completamente o rumo de sua vida.#$e#Apenas pense sobre onde você estaria se não tivesse decidido abandonar seu trabalho na cidade.",
    "Badlands_Qi_fall_Wed":"Você não faz ideia do que vai acontecer, criança.#$b#Tenho grandes planos para você.",
    "Badlands_Qi_fall_Thu":"Sou um homem paciente, criança.#$b#Mas minha boa vontade não dura pra sempre.",
    "Badlands_Qi_fall_Fri":"Você é quem controla sua própria vida, criança.#$b#Não se esqueça disso.",
    "Badlands_Qi_fall_Sat":"O segurança é um bom homem. Leal, faz o que eu mando sem questionar.#$e#Ele não vai adicionar tanto, mas é bom ter alguém como ele por perto.",
    "Badlands_Qi_fall_Sun":"Considerando até onde vai a magia, você mal chegou em sua base, criança.#$b#Teletransporte e ilusões são brincadeira de criança comparados com o que alguém como a Camilla pode fazer.",

    "Badlands_Qi_winter_Mon":"Sei bastante sobre a maioria das pessoas, mas eles não sabem tanto sobre mim.#$b#Prefiro que continue assim.#$b#Se soubessem qualquer coisa sobre mim, poderiam começar a tentar interferir.",
    "Badlands_Qi_winter_Tue":"As pessoas tendem a fugir do caos.#$b#Se sentem ameaçadas ao refletir sobre o quão pouco elas têm controle sobre tudo.",
    "Badlands_Qi_winter_Wed":"Por que você não fala com o meu amigo no balcão, criança?#$b#Talvez ele tenha algo para você.",
    "Badlands_Qi_winter_Thu":"Estive de olho em você por um bom tempo, criança.#$b#Você é uma pessoa interessante.",
    "Badlands_Qi_winter_Fri":"As pessoas tentam esconder seus segredos de mim.#$b#Nunca funciona, de qualquer forma. Sempre descubro, mais cedo ou mais tarde.",
    "Badlands_Qi_winter_Sat":"Tenho certeza que o seu... feiticeiro... é perfeitamente competente.#$b#Eu apenas não apostaria minha vida nele.",
    "Badlands_Qi_winter_Sun":"Você já fala muito com a Camilla?#$b#Ela é de fato... interessante.$1",


    // "Badlands_QiNutRoom_spring_Mon":"",
    // "Badlands_QiNutRoom_spring_Tue":"",
    // "Badlands_QiNutRoom_spring_Wed":"",
    // "Badlands_QiNutRoom_spring_Thu":"",
    // "Badlands_QiNutRoom_spring_Fri":"",
    // "Badlands_QiNutRoom_spring_Sat":"",
    // "Badlands_QiNutRoom_spring_Sun":"",

    // "Badlands_QiNutRoom_summer_Mon":"",
    // "Badlands_QiNutRoom_summer_Tue":"",
    // "Badlands_QiNutRoom_summer_Wed":"",
    // "Badlands_QiNutRoom_summer_Thu":"",
    // "Badlands_QiNutRoom_summer_Fri":"",
    // "Badlands_QiNutRoom_summer_Sat":"",
    // "Badlands_QiNutRoom_summer_Sun":"",

    // "Badlands_QiNutRoom_fall_Mon":"",
    // "Badlands_QiNutRoom_fall_Tue":"",
    // "Badlands_QiNutRoom_fall_Wed":"",
    // "Badlands_QiNutRoom_fall_Thu":"",
    // "Badlands_QiNutRoom_fall_Fri":"",
    // "Badlands_QiNutRoom_fall_Sat":"",
    // "Badlands_QiNutRoom_fall_Sun":"",

    // "Badlands_QiNutRoom_winter_Mon":"",
    // "Badlands_QiNutRoom_winter_Tue":"",
    // "Badlands_QiNutRoom_winter_Wed":"",
    // "Badlands_QiNutRoom_winter_Thu":"",
    // "Badlands_QiNutRoom_winter_Fri":"",
    // "Badlands_QiNutRoom_winter_Sat":"",
    // "Badlands_QiNutRoom_winter_Sun":"",

    "Badlands_MxQi_fall_Thu":"Sou uma pessoa paciente, criança.#$e#Mas minha boa vontade não dura pra sempre.",


//Void Shard
    // "VoidShard_Qi_spring_Mon":"",
    // "VoidShard_Qi_spring_Tue":"",
    // "VoidShard_Qi_spring_Wed":"",
    // "VoidShard_Qi_spring_Thu":"",
    // "VoidShard_Qi_spring_Fri":"",
    // "VoidShard_Qi_spring_Sat":"",
    // "VoidShard_Qi_spring_Sun":"",

    // "VoidShard_Qi_summer_Mon":"",
    // "VoidShard_Qi_summer_Tue":"",
    // "VoidShard_Qi_summer_Wed":"",
    // "VoidShard_Qi_summer_Thu":"",
    // "VoidShard_Qi_summer_Fri":"",
    // "VoidShard_Qi_summer_Sat":"",
    // "VoidShard_Qi_summer_Sun":"",

    // "VoidShard_Qi_fall_Mon":"",
    // "VoidShard_Qi_fall_Tue":"",
    // "VoidShard_Qi_fall_Wed":"",
    // "VoidShard_Qi_fall_Thu":"",
    // "VoidShard_Qi_fall_Fri":"",
    // "VoidShard_Qi_fall_Sat":"",
    // "VoidShard_Qi_fall_Sun":"",

    // "VoidShard_Qi_winter_Mon":"",
    // "VoidShard_Qi_winter_Tue":"",
    // "VoidShard_Qi_winter_Wed":"",
    // "VoidShard_Qi_winter_Thu":"",
    // "VoidShard_Qi_winter_Fri":"",
    // "VoidShard_Qi_winter_Sat":"",
    // "VoidShard_Qi_winter_Sun":"",


    // "VoidShard_QiNutRoom_spring_Mon":"",
    // "VoidShard_QiNutRoom_spring_Tue":"",
    // "VoidShard_QiNutRoom_spring_Wed":"",
    // "VoidShard_QiNutRoom_spring_Thu":"",
    // "VoidShard_QiNutRoom_spring_Fri":"",
    // "VoidShard_QiNutRoom_spring_Sat":"",
    // "VoidShard_QiNutRoom_spring_Sun":"",

    // "VoidShard_QiNutRoom_summer_Mon":"",
    // "VoidShard_QiNutRoom_summer_Tue":"",
    // "VoidShard_QiNutRoom_summer_Wed":"",
    // "VoidShard_QiNutRoom_summer_Thu":"",
    // "VoidShard_QiNutRoom_summer_Fri":"",
    // "VoidShard_QiNutRoom_summer_Sat":"",
    // "VoidShard_QiNutRoom_summer_Sun":"",

    // "VoidShard_QiNutRoom_fall_Mon":"",
    // "VoidShard_QiNutRoom_fall_Tue":"",
    // "VoidShard_QiNutRoom_fall_Wed":"",
    // "VoidShard_QiNutRoom_fall_Thu":"",
    // "VoidShard_QiNutRoom_fall_Fri":"",
    // "VoidShard_QiNutRoom_fall_Sat":"",
    // "VoidShard_QiNutRoom_fall_Sun":"",

    // "VoidShard_QiNutRoom_winter_Mon":"",
    // "VoidShard_QiNutRoom_winter_Tue":"",
    // "VoidShard_QiNutRoom_winter_Wed":"",
    // "VoidShard_QiNutRoom_winter_Thu":"",
    // "VoidShard_QiNutRoom_winter_Fri":"",
    // "VoidShard_QiNutRoom_winter_Sat":"",
    // "VoidShard_QiNutRoom_winter_Sun":"",

//Post SVE Event
    "SVE_Qi_spring_Mon": "É corajoso de sua parte continuar voltando aqui, criança. Gosto disso sobre você.",
    "SVE_Qi_spring_Tue": "$y 'Você deve ter muitas perguntas._O que é 'isto'?_Você vai descobrir em breve._Por que eu?_Já não te disse, criança? Você é especial._(Permanecer em silêncio)_Heh. Com medo, @?'",
    "SVE_Qi_spring_Wed": "Você já tinha minha atenção desde o momento em que saiu daquele ônibus.#$b#Agora, olha só para você...*Heh*.", 
    "SVE_Qi_spring_Thu": "Esse sempre foi o plano, criança.#$b#Você nem imagina.", 
    "SVE_Qi_spring_Fri": "Aliás, perdão por todo aquele silêncio e ar de mistério.#$b#Eu só não podia arriscar, e eu sei como você gosta de falar.#$b#Você entende, certo?#$e#*Heh* Claro que entende.", 
    "SVE_Qi_spring_Sat": "...*Heh*#$b#Você realmente é algo especial, criança.", 
    "SVE_Qi_spring_Sun": "Conheço esse olhar.#$b#Vejo a chama nos seus olhos, criança, a chama que você sempre teve.",
    
    "SVE_Qi_summer_Mon": "Um dia, criança, quando você estiver sentado no topo do mundo, tudo isso vai fazer sentido.",
    "SVE_Qi_summer_Tue": "Ora, ora. Olha só quem voltou.",
    "SVE_Qi_summer_Wed": "E quanto à você, garoto? Vai se tornar extraordinário?$2^E quanto à você, garota? Vai se tornar extraordinária?", 
    "SVE_Qi_summer_Fri": "Tenho planos maiores para você, criança.#$b#Estou ansioso para observar tudo acontecer.", 
    "SVE_Qi_summer_Sat": "Em breve, criança...#$b#Mas ainda não.", 
    "SVE_Qi_summer_Sun": "Você é esperto, garoto. Talvez esperto demais para o seu próprio bem.$2^Você é esperta, garota. Talvez esperta demais para o seu próprio bem.",

    "SVE_Qi_fall_Mon": "Quem eu sou?#$b#*Heh* Quem eu sou não importa. O que importa é quem você vai se tornar.",
    "SVE_Qi_fall_Tue": "Você já chegou tão longe, criança. Até onde mais você vai conseguir chegar?",
    "SVE_Qi_fall_Wed": "Há um momento na vida de cada um, no qual se encontram à beira do precipício da excelência.#$b#A maioria das pessoas não arrisca pular. Se estabelecem na sua mediocridade. Mas não você.#$b#Isso é o que eu venho esperando há tanto tempo, criança: alguém como você.", 
    "SVE_Qi_fall_Thu": "Estou colocando muita fé em você, criança. Não me decepcione.", 
    "SVE_Qi_fall_Fri": "Lembre-se do que eu falei, sim? Não saia por aí falando às pessoas sobre esse lugar.#$b#Ainda sou seu amigo Sr. Qi, não é mesmo?", 
    "SVE_Qi_fall_Sat": "Deve ser tão frustrante, criança...#$b#Ter tantas perguntas, sem poder obter respostas.#$b#Posso ver nos seus olhos.",
    "SVE_Qi_fall_Sun": "Sou um homem de palavra, criança. Nunca se esqueça disso.", 

    "SVE_Qi_winter_Mon": "Um dia, criança, você vai ter o mundo na palma de sua mão.#$b#Quando estiver lá, talvez você comece a entender quem sou eu.",
    "SVE_Qi_winter_Tue": "Deixe-me contar um segredo#$b#Não existe um dom que determina se você vai ou não alcançar a excelência.#$b#Apenas uma escolha e sua determinação de fazê-la.",
    "SVE_Qi_winter_Wed": "Você nunca para de me impressionar, criança. Alcançar o fundo das minas é uma coisa. Passar pelo Deserto Carmesim é uma façanha completamente diferente.#$b#Entretanto, sabia que iria conseguir.", 
    "SVE_Qi_winter_Thu": "Nada escapa de mim, criança. Não se esqueça disso.$1", 
    "SVE_Qi_winter_Fri": "*Heh* Bem-vindo de volta.$2^*Heh* Bem-vinda de volta.", 
    "SVE_Qi_winter_Sat": "Seja cauteloso, garoto. Nunca se sabe o que o espera.$2^Seja cautelosa, garota. Nunca se sabe o que a espera.", 
    "SVE_Qi_winter_Sun": "Você é um guerreiro, garoto. Continue assim.$2^Você é uma guerreira, garota. Continue assim.",

    
    "SVE_MxQi_fall_Fri": "Lembre-se do que eu falei, sim? Não saia por aí falando às pessoas sobre esse lugar.#$b#Ainda somos amigos, não é mesmo?", 
    "SVE_MxQi_fall_Sun": "Sempre mantenho minha palavra, criança. Nunca se esqueça disso.",


}