{
    //Leah
    "Leah_c_title": "To my close friend - Leah",
    "Leah_l_title": "To my best friend Leah",
    "Leah_d_title": "To my beloved Leah",
    "Leah_h_title": "Apology letter to my beloved-Leah H",
    "Leah_e_title": "To My Beloved - Leah",
    "Leah_di_title": "To the one I once loved so much-Leah",
    "Leah_crush_Text": "Dear @^^@,How are you doing? As I write this letter, I am sitting in my cabin on the banks of the Mineral River, looking out the north window at your quiet field. Many a time the sound of the rushing water of the Mine River has knocked softly on the door of the cabin, accompanying me on my days of painting, sculpting or just eating and resting. ^^@ Can you hear the sound of running water in your garden too? ^^^ Your close friend Leah",
    "Leah_c1_Text": "Dear @^^^ Have you seen the dandelions in spring, @? At the door of the cottage, goose-yellow dandelions are blooming in clusters, like beauties with flower crowns on their heads ...... I can't wait to pick some fresh leaves for my salad. ^^ Meet me at my cabin if you want to try the salad too, but I can't promise to pick enough dandelions, haha. ^^ Your close friend Leah",
    "Leah_c2_Text": "Dear @^^ In the spring I like to go sketching on Mineral Lake, painting the dappled shade trees or the sunfish swimming under the water. In the nearby bushes you can occasionally find bright yellow daffodils and in some cases wasabi and leeks. If you're willing to head deeper into the grassy landscape, you'll also see a few nondescript bird nests in the low branches - the chicks inside are surprisingly quiet, not sure if they're sleeping or if my footsteps are scaring them. ^^@, if you're willing to take a walk in the woods in the countryside, you can find lots of new things. ^^ Your close friend Leah",
    "Leah_c3_Text": "Dear @^^^ When I woke up in the morning, the warm daylight shone through the gauze curtain on my face. There is something magical about summer in Stardew Valley, it seems that everything around me is starting to get hot, even my sculpture is beading with sweat. But @, the flowers and vegetable seedlings probably love this season. ^^ Your close friend Leah",
    "Leah_c4_Text": "Dear @^^ I am writing this letter to you from the sea of the Jewel Sea, @. At this moment, the crisp salty sea breeze brushes past my temples and the vast ocean waves sway with sparkling daylight. The shallow water is washed white gravel and bright green algae, and some shells are scattered in the tidal pools, while deeper down I seem to see schools of chasing and playing red snapper. ^^ I wonder if there will be any more colourful coral trees on the bottom of that extremely diverse sea? ^^ Your close friend Leah",
    "Leah_c5_Text": "Dear @^^ Hazelnuts, mushrooms, wild plums ...... Do you smell them yet, @? The hot light of summer is fading away and the Mineral River is not running so merrily. ^^ If you pass by my cabin, come in and sit down,@ and the sound of running water will no longer muffle the sound of your knocking. ^^ The oaks in front of my house were once a greener green, and now they are yellowing, but they are still enchanting. ^^Your close friend Leah",
    "Leah_c6_Text": "Dear @^^@, Are the harvest days busy? If there is one kind of busy that can bring you joy, then she must be the busy-ness of the autumn harvest. Autumn is the season of goat's cheese, the softness and aroma are not unlike what late autumn brings to me ...... Hope to see you soon, @. ^^ Your close friend Leah",
    "Leah_c7_Text": "Dear @^^ In a few days it's the Ice Festival and I'll be preparing some ice sculptures for Pelican Town ...... Maybe winter is a wonderful holiday for the Tian family, but my life is busy. In a few days, I have to prepare the Winter Star Tree with Robin, those decorations are carved by me and Robin. ^^ Your close friend Leah",
    "Leah_love_Text": "Dear @^^@,What do you usually do in your farming time? During the day, I like to sculpt inside my cabin or write and draw. It's like I was born for it. ^^ When I wield a file and a paintbrush, I am embracing art. And as I write this letter for you, my thoughts are drawn to you. ^^ Your dear friend Leah",
    "Leah_l1_Text": "Dear @^^^ Do you like to walk along the Mine River, @? I'll describe the view for you ...... There's always a thin layer of water misting the Mine River in the early morning, and the stem of the river with its young green branches floats in the beads of mist as if I could just reach out and pull out a little piece of it. When the young daylight began to shimmer on the river, the beads of mist steamed into clouds in the sky with the previous greenery ...... The yellow daffodils and dandelions that had been floating behind that haze gradually awoke, and I walked down the river stem towards the forest, picking up hands full of fresh, sweet flower air along the way. ^^ If you will come to the Mineral River, I will be here waiting for you. Do not wait until the river is gradually rising, when the yellow daffodils and dandelions will have withered. ^^ Your dear friend Leah",
    "Leah_l2_Text": "Dear@^^When the miscellaneous daisies bloom in the pastures,^^^ the blue violets, the white beauty shirts,^^^ and the rhododendrons with their delicate yellow buds,^^^ pointing out a vast rejoicing. ^^As I have told you, spring is very pleasant here. I am only writing this letter in the hope that you will not forget the sights of spring in the midst of your farming duties. ^^Your dear friend Leah",
    "Leah_l3_Text": "Dear @^^Would you like to come to the beach? I want to paint you in the sea breeze or make you a statue, like Britannia ...... Let me think, you must look stunning lined with waves. ^^...... But the work in the fields is always so busy, isn't it? I always have the illusion that it's as if we made some kind of a pact the last time we met and you didn't make it on time. How else would I always think of you on some uneventful morning, noon, evening and midnight by the sea? ^^ Yet I know full well that we didn't make any promises, and that's the part that makes me most gloomy. ^^Leah",
    "Leah_l4_Text": "Dear @^^ The summer sequins in the flower pot reminded me of you ...... I'm so sorry, @. I don't know why I wrote a letter like that a few days ago ...... I feel like I'm obsessed. We weren't lovers ...... or one of the siblings, we were close friends and friends always have busy times. At least that's what I convinced myself ......^^ I'm sorry, @, if that letter bothered you a lot ...... I don't want to do something that my friend and I will regret. Please send it back to me if it's convenient, I'd like to burn it. ^^ Your dear friend Leah",
    "Leah_l5_Text": "Dear @^^ How do you like it here in the fall? I love the warm red leaves, their enthusiasm is just right for the cold and detached yellow leaves around them. I want to go out and borrow a camera so I can take pictures like that and stick them on my bed, on the wall, in front of the window ...... or stick them inside the book I'm reading as a bookmark. ^^ The weather has been a bit too crisp and cold lately, if I went out all day with my drawing board I'd catch a cold. ^^ Your dear friend Leah",
    "Leah_l6_Text": "Dear @^^ Late fall is truffle scented ...... I'll be up north in the mountains looking for truffles these days. I've spent so much time by the mining river that I've almost forgotten what that deep forest looks like, and the adjacent dry riverbed and deep mine shaft still sound a little scary. ^^ Don't worry about my personal safety, Abigail will be there with me. ^^ Your dear friend Leah",
    "Leah_l7_Text": "Dear @^^ Are you interested in ice sculpting? Come to my cabin if you want, I can teach you how to make ice sculptures ...... The ice sculptures at the ice festival were made by me and Robin. ^^ It's freezing cold here and I can't see a bit of new green or hear a bit of birdsong, I'm a bit lonely on my own. ^^ Your dear friend Leah",
    "Leah_date_Text": "To my love ^^ Thank you, my dear. When I received that bright bouquet of flowers from your hands, my eyes almost burst into tears. The countless days of tossing and turning, the countless days of going crazy with thoughts of you are all gone. My love, @, my life shines because of you. ^^ Sorry, there are still some tear stains on the paper, but I've replaced many pieces of paper, and this is the last one I have left. Please do cherish this letter, I love you always. ^^ Your love Leah",
    "Leah_d1_Text": "To my love ^^ Dear, remember to visit me often on the Mine River, spring is the season of longing. I so want to make you a salad with the newborn dandelions and leeks by the Mine River - they are both children of spring and I want to see you savoring the spring with joy. ^^ I'd love to see you soon, my dear. ^^ Your love Leah",
    "Leah_d2_Text": "To my love ^^ I planted a yellow daffodil in a pot in the shed the other day, and she actually bloomed last night. But for some reason, she looked much duller than the wild ones and the buds didn't quite bloom - ah, wait, a bee flew in and she seemed to be interested in the yellow daffodil. This bee has a unique eye for it. ^^ I really want to see you soon, my dear. ^^ Your love Leah",
    "Leah_d3_Text": "To my love ^^ As summer treads her passionate palm leaves and waves towards us, I should perhaps go to the beach and paint a picture or make a sculpture, but don't let the apparently hot light get in the way of artistic fervour. ^^ If you miss me too, come and see me on the beach, we can spend all day on the jeweled shore, stroking the soft, hair-like gravel of the sea. ^^I'd love to see you soon, my love. ^^ Your love Leah",
    "Leah_d4_Text": "To my love ^^ On my walk in the countryside today I thought I smelled hops, I wonder if there are wild hops in full bloom around here? The smell is similar to mixing citrus and pineapple together, a lot more refreshing and sweet and zingy compared to beer. ^^ I really want to see you soon, my dear. ^^ Your love Leah",
    "Leah_d5_Text": "To my love ^^ O knight, what afflicts you, wandering alone in frustration? ^^ The reeds in the lake have withered, and no bird sings. ^^ What afflicts thee, O knight, so haggard and sad? ^^The squirrels' nests are full of food, and the crops are in the barn. ^^ Thy love Leah",
    "Leah_d6_Text": "To my love ^^ Do you like sautéed mushrooms, my dear? That's one of the few dishes I know how to make. In late autumn, the coal mine forests are full of mushrooms of all kinds, and while these wild little creatures are delicious, it's not easy to tell what kind they are and whether they're poisonous. ^^ If you want to try some sautéed mushrooms, I can try to make one for you. I try to make sure I use non-poisonous mushrooms, haha. ^^ I really want to see you soon, my dear. ^^ Your love Leah",
    "Leah_d7_Text": "To my love ^^ I'm getting busy again, sweetie. I was looking for inspiration for this year's ice sculpture, so I ran out onto Mineral Lake and wrote this letter to you from the centre of the lake. The ice is solid around here, so don't worry about my safety. ^^ The view here is stunning, the branches of the trees hung with freezing fog look like they've been hollowed out of alabaster ...... I wonder if I could shape this sense of art with ice? ^^ I'd love to see you soon, my dear. ^^ Your love Leah",
    "Leah_f1_Text": "Dear @^^ I hope you haven't forgotten ...... It's Easter tomorrow. I was asked by Lewis to help him with the many, many spring decorations back when spring first started and I've been busy for a while. ^^ I'd love it if you'd like to come into town and see it. ^^ Your dear friend Leah",
    "Leah_f2_Text": "Dear @^^^ My cabin is on the edge of the coal mine forest, just a short walk away from the Flower Dance Festival grounds. As far as I can remember, when the Coal Mine Forest is in full bloom, it seems to be a traditional custom here to enjoy spring by going to the meadow filled with greenery and doing a dance. ^^ So ...... I have a request that may sound a little presumptuous, and I would like you to be my dance partner if you haven't already thought about who you would like to ask to dance. This is an annual dance that I would like to do with just you. ^^ Your best friend Leah",
    "Leah_f3_Text": "Dear @^^ Are you going to the luau? I'm planning on bringing a goat cheese over, I love the delicate and mellow texture - what kind of ingredients would you like to bring? I prefer to savor a glass of fruit wine on the beach of the Jewel Sea than a party, looking south at the water and sky. ^^ I have to go sketching on the beach today, so that's enough of this letter for now. See you tomorrow, @. ^^ Your dear friend Leah",
    "Leah_f4_Text": "Dear @^^^ Please come to the beach tomorrow night, @. I want to go with you to see the moonlight jellyfish that come from far out to sea and watch them sway and dance in the water ...... I also want to send off the hot summer light and the clear salty wind and waves of the Jewel Sea with you, and I have so many thoughts about art I want to share with you... ...right here on this romantic holiday. ^^ Your dear friend Leah",
    "Leah_f5_Text": "Dear @^^ Do you like All Souls Day? All I remember about All Souls is some monsters for exhibition only, and tables full of pumpkin soup, grenadine and aged cheese that you can slice and enjoy at will. I wonder what's at the end of the All Souls maze? I get drunk every time I go in and I'm afraid I'll get lost. ^^ That's enough of this letter for now, @. I'm off to get dressed up and change into something appropriate for All Souls Day. See you at the festival. ^^ Your dear friend Leah",
    "Leah_f6_Text": "Dear @^^ The Christmas feast is the one I look forward to the most all year, in past years Lewis would get lots of poppyseed wine from the city, the taste was so sweet and refreshing I got drunk every time ...... and to top it off Gus would make Yuletide pine nut cake. ^^ It would be nice if you went to the banquet too, then someone would take me home even if I got drunk. Haha. ^^ Your best friend Leah",
    "Leah_fd1_Text": "To the love of my life ^^ Are you coming to town tomorrow for Easter? I'd love to see your smile soon, my dear. I've done something new with the Easter decorations this year, so don't be stingy with your genius lover then, haha. ^^ Your love Leah",
    "Leah_fd2_Text": "To my love ^^ The dandelions and yellow daffodils are almost out of season, but the coal mine forest is still so charming with its flourishing flowers. What could be more enchanting on a day like this than a dance with the one you love so much? I'll be wearing my floral dance dress for the first time in a long time, so don't forget to dress up too. ^^ Your love Leah",
    "Leah_fd3_Text": "To my love ^^ Tomorrow is the luau, don't forget to be on time, my love. I haven't seen you in a while, so don't let me miss you too much. ^^ I'm going to pour a bottle of fruit wine into the soup this time, I wonder what ingredients you're going to prepare? I'm quite looking forward to it. ^^ Your love Leah",
    "Leah_fd4_Text": "To my love ^^ Don't forget the fete tomorrow night, my love, I want to take a walk on the beach with you. We can put down the boat lights together and watch the moonlight jellyfish return to the depths of the jeweled sea. ^^ Don't make me wait too long yo. ^^ Your love Leah",
    "Leah_fd5_Text": "To my love ^^ Do you want to try the labyrinth at All Souls' Day? If you find anything interesting in the maze, remember to tell me about it then and satisfy my curiosity. ^^ Of course, if you're as scared of monsters as I am, you can meet me at the table. It's also a good idea to taste the grenadine and aged cheese of Stardew Valley in late autumn. See you then, my dear. ^^ Your love Leah",
    "Leah_fd6_Text": "To the love of my life ^^ I hope to see you at Christmas, my dear. I first spent a week making lots of ice sculptures, and then another ten days carving all sorts of decorations - but I'm not tired or bored, and it would be too lonely a winter to have nothing to do. For tomorrow, I'm going to dress up, put on my winter coat, prepare my appetite for spiced punch and pumpkin soup, and listen to a cheerful Kalinka in a garden full of holly and crocuses ...... I can hardly wait. ^^ Actually I'm a bit concerned about who your secret friend is, but out of tradition I'd rather not ask. ^^ Your love Leah",
    "Leah_h_Text": "To my love ^^ Dear, I've thought long and hard about this, but I still think there's something I must explain to you. ^^ I saw you at the Abigail's concert when Mr. Elliott was standing right next to mine, engrossed in the music - but we actually met by chance at the concert. Abigail's music was so beautiful, the rhythmic songs filled my heart with enthusiasm and passion, and Mr Elliott happened to be feeling the same way at the time, so we danced out of kindness to my friend. ^^ However, when I turned around and saw you standing there frozen, looking at me with sad and puzzled eyes, I immediately realised what a foolish thing I had done. I pushed Elliott away and walked straight in your direction. My mind went blank and my only thought was to get back to you as soon as possible, but I was about to take your hand and explain all this to you when you ran away without a backward glance. I still remember your face pale as if you were suffering from a fever in the crimson glow of the setting sun. ^^ Darling, you are my only love, and my love for you is as eternal as the planets in the Milky Way or the pendulum on the church. I will never go to another concert like that, never again will I do anything to hurt you or me in the heat of the moment, I promise. I beg you to forgive me for my transgressions, I was too afraid of losing you for that. Darling, I have lived without you like a fish out of water. ^^ Your only and ever faithful love Leah",
    "Leah_e_Text": "To my darling ^^ Is it in the bright flower gardens of Mineral Lake? Or under the oily green oaks in front of the cottage? I don't know, a dream-like joy surrounds me. When did we first meet? I don't remember, just as I don't remember the oil paintings I have hanging out to dry or the sculptures I have made and left there in prototype form. Since we said goodbye to each other, my mind has been filled with feelings about you that have made me forget everything, forget myself - but if there is one thing that has enlightened me, it is that I am going to be your wife. ^^ Farewell, my cottage; farewell, the green oaks. I'll go to the quiet fields with my eternal love. ^^ Your eternal wife Leah",
    "Leah_di_Text": "To the one I once loved so dearly ^^When I leave, your fields will still be enchanting. ^^ You and I probably both know that the conflict between us has been irreparable. Having come to this point, I don't know what to say, but I can't suppress my feelings. I don't regret meeting you, but how I wish our relationship had stopped at best friends, so that we could never again have everything that came after, including all the laughter and tears, all the memories of touching and sadness. ...... But that's impossible. I still love you dearly, but I don't want to see you anymore. ^^ I have moved back to my little cabin and the oak tree in front of the house is still greener and bushier, just much taller than before. ^^ Your former love Leah",    
    
    //Penny
    "Penny_c_title": "To my best friend - Penny",
    "Penny_l_title": "For my best friend - Penny",
    "Penny_d_title": "For my sweetie - Penny",
    "Penny_h_title": "For My Sweetheart - Penny H",
    "Penny_e_title": "For My Sweetheart - Penny",
    "Penny_di_title": "Pelican Town West Farm Collect",
    "Penny_crush_Text":"@^^ Thank you for helping me out, @. My life is such a mess in general, the stress is not only from my mother's side but also teaching my two young children to read, so it's good to have a friend like you willing to lend me a helping hand. ^^ Again, my sincere thanks to you. ^^Penny",
    "Penny_c1_Text":"@^^@, I am writing this letter to enquire how many days does it take for the red leaf cabbage to mature? I wasn't able to give an exact number when the kids asked me this question before. ^^^ The children love spring here and I love to take them to outdoor lessons in the coal mine forest, just south of your farm. I sometimes wonder if you go for a walk around Coalmine Woods once in a while? ^^Penny",
    "Penny_c2_Text":"@^^ Do you know where there are scented berries around here, @? I want to take these kids on a lesson about plants in the wild. It's just too hot in the summer, but the two kids are unexpectedly energetic and I just can't keep up with them physically. ^^ Have you been planning to go to a museum lately? That's where I have my classes. If you're planning to go, you can drop by and tell me about that question above. ^^Penny",
    "Penny_c3_Text":"@^^ What do you usually plant in the fall? I'm always a bit curious about the farm thing. Even though Pelican is a small town and close to the surrounding mountains, I stay inside the town most of the time. ^^ There's a lot of trouble on the home front, the government people are coming to collect taxes again, and my wages are nowhere near as fast as my mother can spend them. If only I had a big farm like you do. ^^Penny",
    "Penny_c4_Text":"@^^ Is everything still going well these days? Usually in the winter time I cut back on the kids' outdoor time, it's just too cold after all. But I do occasionally take them out to play in the snow or go ice skating on the mineral lake. ^^@, is winter a lot lighter for you than other seasons? It's so nice. ^^Penny",
    "Penny_love_Text":"@^^ Thanks again for all your help, @, I don't know how I can ever repay you. I might even be able to help some if you have small children, but that kind of repayment is none of your business after all. ^^ I would like to know if ......@ has a wife, or someone he is attracted to. It doesn't matter if there is, I want to respond to @'s help, but I definitely don't want to be a nuisance to @. ^^Penny",
    "Penny_l1_Text":"@^^ Is everything ok, @? I went to Gunther's today and he was working on a batch of ore that had just been dug out of the frozen ground. Do you often go inside the mines up north? If you find anything you can give it to me, I'm really interested in the antiquities that have survived through the ages and it would be good for me to teach my two children some history and geography related lessons. ^^ Spring is the perfect time to be outside, so I'm off to teach my two children outdoor lessons, see you later. ^^Penny",
    "Penny_l2_Text":"@^^@, do you know how to grow melons? I'd like to grow a small pot on my balcony. I especially like the sweet crunchy taste of fresh melons and if I could have a small yard I could grow my own to eat. ^^ I used to grow a pot of Yucca flowers outside the caravan, only for my mother to get drunk one day and kick the pot into the river. I was a little girl at the time and was sad about it for a long time. ^^Penny",
    "Penny_l3_Text":"@^^ I wonder if you're busy with the autumn harvest? Just look at all the delightful vegetables and fruit trees on your farm. For me, autumn is always linked to overtime, but it's not that Gunther or the boys want me to work overtime, it's just that there are so many things that have to come to a standstill once winter rolls around. Usually in the autumn I have to assist Gunther with the identification of ores and antiquities, and there are also things to do with soil research that need to be done with the autumn crops, all of which have to be done before winter. ^^ By the time winter rolls around, the kids and I will have a break. ^^Penny",
    "Penny_l4_Text":"@^^ It's winter before you know it, so don't forget to add a coat of cotton, @. ^^ I'm actually quite envious of your farmhouse, it must look so warm. There's neither heating nor insulation in the caravan, so the only way to keep warm is to turn the air conditioning on, but then it costs a lot more in fuel. A few years ago the cold froze the condensation pipe in the caravan and since then I have had to wrap up under a blanket in my bedroom to get a little warmer. ^^Penny",
    "Penny_date_Text": "Dear @^^ Dear @, I'm not quite used to writing letters with such an intimate term of endearment. I actually started to like you a little when you first reached out to me, but due to my introverted nature, I've never been too bold to show you how I feel. But now, you have expressed your feelings to me before me and I feel happy. ^^ Wouldn't those two children feel unusually surprised if they found out that their teacher had a lover. ^^ Love you Penny",
    "Penny_d1_Text": "Dear @^^ Are things going well on the farm? Spring should be the season for farming and planting, I think. If you can, come and see me and these two children over here in Coalmine Woods once in a while, they are always so curious about your farm. ^^ Here's a dish I made myself, I hope you like it. ^^ Love you Penny",
    "Penny_d2_Text": "Dear @^^^ Do you know how to fish, @? If you can, please help me catch a sandfish up. The numbers of this ancient fish have been declining rapidly in recent years, and they are now almost invisible in the rivers and lakes of Stardew Valley, a phenomenon I suspect may be inextricably linked to the changing geography of the area. If you could send me one, I could send it to Gunther for further study. ^^ Love you Penny",
    "Penny_d3_Text": "Dear @^^ Dear, I'm having some melon cravings, do you grow melons on your farm? ^^ Your arrival has made life so much easier in Pelican Town, we used to have to get our vegetables from Pierre, which he claimed came from nearby farms - the ones he labelled as *green and natural* were expensive. Since you've been here, Lewis buys large quantities of fruits and vegetables directly from your farm, and Pierre doesn't dare to ask for a lot of money. ^^ That's a bit of a long story, remember to leave me a melon if you have one, but not if you don't. ^^ Love you Penny",
    "Penny_d4_Text": "Dear @^^ Dear, the weather is getting cooler, don't forget to add some extra clothes. When I went to the colliery forest with the children the other day I found so many hazelnuts and mushrooms in the bushes around. We gathered a lot of ripe hazelnuts together by the mine river and the children had a lot of fun. ^^ I made this roasted hazelnut myself, I hope you like the taste of it. ^^ Love you Penny",
    "Penny_d5_Text": "Dear @^^^ The Mineral River is full of migrating fish inside in late autumn, so if you like fishing, the lake island at the edge of the coal mine forest would be a good place to go. ^^ When we used to have outdoor lessons, Vincent made a little fishing hook - he was really imaginative - and then he went and pulled a few fibres inside the bushes and mixed them with worms to make a lure. He told me it was a recipe Linus had taught him. ^^ Although the boy is never quiet enough to learn, I do appreciate his creative side. ^^Love you Penny",
    "Penny_d6_Text": "Dear @^^ What are you going to do this winter? Will it be cooking in the greenhouse or looking after the animals? ^^ Winter has made the whole town lethargic, and the only people who would say that they would go out in the freezing weather would be the children. Although the children are already enjoying their holidays, I still take them to the museum on concentration days, but this time to show them the antiques and minerals in the museum. The children don't hate learning, which is a great relief to me. ^^ By the way, this is a dish I have been learning for a long time, I hope you like the taste of it. ^^ Love you Penny",
    "Penny_fd1_Text": "Dear @^^ Tomorrow is Easter and those two kids have been looking forward to it all winter. If you're not too busy, I'd like you to be there and help me watch Vincent and Jas. They both have just too much energy and I can never keep up with them. ^^ See you at the festival tomorrow. ^^ Love you Penny",
    "Penny_fd2_Text": "Dear @^^ Will you come to the Flower Dance Festival tomorrow? I want you to be my dance partner. ^^ The children have asked questions about who I will be dancing with in previous lessons and I would like them to get to know you a little better. I'm their teacher and your future wife, you'll fit right in with the kids. ^^ Love you Penny",
    "Penny_fd3_Text": "Dear @^^^ This party - to be honest - is more of an image display for the governor's arrival. Lewis cares so much about the taste of this soup that he will ask everyone to prepare the ingredients carefully - after all, this is the only chance he has to show his political performance to the state all year round. Only this image show has nothing to do with his promotion, *I like being a town mayor* so he says himself. ^^ Although the festival was tainted with politics, at least the children had a good time. ^^Love you Penny",
    "Penny_fd4_Text": "Dear @^^@, what do you want to exhibit at the fair tomorrow? ^^ As far as I can remember, Lewis' criteria for judging have never changed, it's just variety, quality and price - but he's fussy about each of these to the point of being fussy, but I'm sure the fruits of your labour will win his praise. ^^ Love you Penny",
    "Penny_fd5_Text": "Dear @^^ When I was a little girl, I loved Christmas. It wasn't just because I could eat the kind of cooking I wouldn't normally dare to hope for at the holidays, but also my obsession with the Christmas tree hung with coloured lights and ornaments ...... By the way, secret friends are always full of surprises too. ^^ In recent years, that Christmas tree has gotten prettier and prettier, and the holiday spirit has grown with it. I would love to go under the tree with you and rummage through the presents. ^^ Love you Penny",
    "Penny_h_Text": "Dear @^^ Thank you for giving the children such a lively and fun outdoor lesson, they were so full of all sorts of lovely curiosity about life on the farm. Jas is a very well behaved little girl ...... and Vincent is a bit naughty and reckless but that is the nature of little boys after all. They are both very sweet children. ^^ I don't know if you know Vincent's brother? His name is Sam and he is a very close friend of mine and he is the one who receives me whenever I come to visit my home because Vincent is not getting good grades or has gotten into trouble. Since we were about the same age, we got to know each other pretty well, but I wouldn't be with him if it came to being a future partner. ^^ As for that boy Vincent - I could see that he sometimes made mistakes on purpose to give Sam and I a chance to be alone, and perhaps the incident he mentioned in the coal mine forest was for the same reason. It was a bit of a bummer, but when you think about it Vincent was still very sweet and kind. Sam is still lucky to have a brother like that. ^^ Love you Penny",
    "Penny_e_Text": "For my sweetheart ^^ I had a feeling we would be together, but I was still pleasantly surprised when you gave me the mermaid pendant. My engagement to you is the most precious memory of my life and I will always treasure it deep in my memory. ^^ Enclosed is a gift I have prepared for you, please keep it well, I want it to be a testament to our relationship. ^^Love you Penny",
    "Penny_h2_Text":"@^^My secret lover,@, please come and see me soon, I can't wait - ^^^ No wonder! @, I don't care what happened between you and Abigail, but I'm warning you solemnly that you are insulting my character and hurting our feelings by doing this. If I didn't have to work today, I would have to question you face to face. You should be glad I didn't tell Lewis about this, or you'd be in court by now! ^^ I don't know what you're trying to do,@ and I don't know why you're doing it. I hate telling people what I've done for that man, as if I'm begging for mercy - but I decorated our bedroom with my own hands, didn't I? The countless breakfasts I've made for you, of course you must have forgotten how they tasted, eaten dry and disowned talking about you. I get up every morning and make you breakfast, then I have to work all day and come back at night and prepare for class - I do this for us as a family, so we can live happily ever after, not to create free time for you to go out and fuck around with purple haired bitches! ^^ I told Caroline about this yesterday, and you - either break up with that bitch right now, or prepare for a divorce." ,
    "Penny_di_Text":"@^^ There is no doubt that our marriage is failing. I don't know what happened between us, it seems like we just stopped opening up to each other from one day to the next and eventually it even came to the point where you didn't even have the patience to discuss the divorce with me in advance. ^^ But now I see that you're just a selfish person. How do I explain to my children that their teacher walked into a failed marriage? And how am I supposed to explain to them that not all marriages are like that? Shall I continue to describe to them, with a smile on my face, that there are happy and fulfilling marriages in the world, so that they don't give up on their good dreams? I would say that out of duty to my children, but I don't believe in it myself anymore. ^^ May you do well. ^^*Since the sender has not given his name and address, the following sender information will be filled in for him by the Fingal Post*^^ Ms. Penny, 2 River Avenue",
    
    //Abigail
    "Abigail_c_title": "For my friend - Abigail",
    "Abigail_l_title": "For my good friend - Abigail",
    "Abigail_d_title": "For my love - Abigail",
    "Abigail_h_title": "For my best friend - Abigail",
    "Abigail_di_title": "Pelican Town West Farm Collection",
    "Abigail_hn_title": "Pelican Township Water Service",
    "Abigail_crush_Text":"@^^ My friend - @, so glad I can call you that. I don't really like writing letters, after all, there are many things that can just be said in person and there is absolutely no need for all the red tape. But Caroline told me that keeping in touch is part of what keeps a friendship alive, so I'm writing you today mainly to make sure you haven't forgotten about me. ^^ Well, see you later. ^^Abigail",
    "Abigail_c1_Text":"@^^ How's it going, @? There's always people coming and going in the grocery shop in the spring, which I guess is what you always call farming time, it's almost noisier than Carolyn's aerobics rally. ^^ Good thing I have a soundproof headset and Pierre doesn't nag me at this time of year, nothing is as important to him as the customers. Even if Caroline came to annoy me, I could at least hide out the door. ^^ Well, see you later. ^^ Abigail",
    "Abigail_c2_Text":"@^^ It's autumn all of a sudden and the weather is turning a bit cooler yet. On late autumn evenings I usually go over to Gus's and he occasionally makes some cider and pumpkin soup, but I don't really like the taste of fruit wine. Some days Sebas and Sam would go too, but they were there to play pool, and even though the three of us were in the same band, I still felt as if the two of them got on better with each other. ^^ Well, see you later. ^^ Abigail",
    "Abigail_love_Text":"@^^@, I'm going to inform you of something very important next, and it concerns your *knightly* honour - ^^^ I declare you to be my best friend now! I don't know if you will be surprised by these words, or think I am a strange person, but as far as I know you, I guess you should feel pleasantly surprised. ^^ Well, that's all I'm writing to say, see you later. ^^Abby",
    "Abigail_l1_Text":"@^^ Do you have anything important to do today? If not I'd like you to come to the grocery shop and talk to me or something, I'm bored out of my mind staying home alone. ^^ My new game cassette hasn't arrived yet, so if it does I'll invite you to come and play with me. What games do you like to play, Ashen Souls, Mount&Blood, I'm curious. ^^ See you later. ^^Abby",
    "Abigail_l2_Text":"@^^What's been going on over the summer? I guess there's not much for you to do, after all, it's so hot outside that the slightest movement makes you sweaty. ^^ Although there was air conditioning in the grocery shop, Pierre never bothered to turn it on, he was forever saddened by the cost of the electricity. If it got really hot, he'd run to Gus's after closing to blow the bar air - and as for the air conditioning in the grocery shop, hell knows who it was for. ^^See you later. ^^Abbey",
    "Abigail_l3_Text":"@^^ Do you have pumpkins on your farm? I especially like that vegetable. I used to carve a little pumpkin lamp and put it on the coffee table on the first floor and it scared Caroline in the middle of the night, she thought a wandering spirit had come to her with a lamp, haha. ^^ I like to go and spend time in the cemetery at midnight in late autumn, it's the quietest place in the whole town and Pierre has argued with me about it a few times. He always tells me that places like that are not clean - in short it just gets in the way of him getting rich on an occult level again. ^^See you later. ^^Abbey",
    "Abigail_l4_Text":"@^^ Winter is the season that belongs to music, though I've almost forgotten when the last band rally was. In winter, the streets become less pedestrianized, and if you go for a walk in the wilderness at this time of year, you can find a lot of new and exciting things. ^^ I can't think of anything else to share with you now, winter is always so dull. That's enough of this letter for now, see you later. ^^Abby",
    "Abigail_date_Text":"@^^ Receiving your bouquet was undoubtedly the biggest surprise of my life - don't look at me like this, I haven't confided my heart to anyone but you. I hadn't thought about who I would be with before - after all, I spend most of my time in games and comics, so I was naive enough to think I didn't need to fall in love with anyone, but meeting you has made me aware of new possibilities. I'm honored to be your girlfriend. ^^ I'm not a good writer of mushy words, so let's talk in person if there's anything we can do. See you later. ^^Abby",
    "Abigail_d1_Text":"@^^ I had a fight with Caroline today, and you can probably guess what it was about - yes, it was my hair colour again, something that is a real cliché in her mind. She hates my hair colour and is always condescendingly accusing me of throwing away my long chestnut hair that I was born with, when I don't even remember dying it. I've tried to explain my hair colour to her, but as soon as I open my mouth, she immediately says I'm being sophomoric, and by the way, reminds me again* that I'm only able to live here because of her and Pierre's kindness. ^^ As for Pierre, I wasn't impressed with him, and he would rather stay with the customers than bother with Caroline and me anyway. I just couldn't understand how a real father could live his place in the family even worse than a stepfather. ^^ Take me to your farmhouse soon, and when I'm your wife, they'll have no room to argue. Haha. ^^ Abbie",
    "Abigail_d2_Text":"@^^ I took a trip to the Mage's Tower the other day, it's really full of mysteries, I wonder what the Mage is working on in there all day? To the north of the tower is a mysterious forest, at the end of which is a crystal clear pond full of fish I can't name. By the way, there are a lot of Slimes in the bushes that are hostile to humans, so don't forget to bring your weapons if you're going to explore there. ^^See you later. ^^Abby",
    "Abigail_d3_Text":"@^^ Hi @, I'm writing to you from the bar. Gus got me letterhead and a pen, and a cold beer. ^^ I'm curious, do you usually come to the bar for pleasure? Most of the time I come to the bar to play video games, but occasionally I do come here for a get-together with my band mates, after all I don't want to stay in a stuffy grocery shop all night - Caroline would kill me if she found out I was sharing a room with two young boys holding guitars. ^^ Well ...... you'd better make nice with Caroline or she might kill you too before you get anywhere near my bedroom. Of course, I'm kidding. ^^Abby",
    "Abigail_d4_Text":"@^^ The games at the fair were still fun and I traded my star coins for a floppy hat that I want to decorate my coat rack with. This festival is also one of the few times I get to meet the mage, who always stands not far from the divination table with a thoughtful look on his face. I've tried to say hello to him before and he occasionally responds to me, but when I ask about magic, he again always says I shouldn't get overly curious about such things. ^^ But he still gave me an introductory alchemy recipe book. ^^Abby",
    "Abigail_d5_Text":"@^^ It's really boring in the winter, come and visit me soon. ^^This is for you, see you later. ^^Abi",
    "Abigail_fd1_Text":"@^^ Do you like Easter, @? I love the holiday, especially the egg hunt. Even though at my age it might seem a bit childish to play games like that, I still have fun. ^^ If you want to come to the event too, don't forget to be in the town centre on time, I'll be there waiting for you. Even though I'm your girlfriend, I won't show you any mercy when it comes to the game, haha. ^^ See you later. ^^ Abi",
    "Abigail_fd2_Text":"@^^ I especially like the luau because it's a different kind of festival than the quaint and literary traditional ones, where I can celebrate with my friends without worrying about touching inexplicable red tape - and there's free beer, roast meat and Baileys soup. ^^ But I'll be damned if Caroline will find out I've been drinking. ^^ See you at the festival. ^^Abby",
    "Abigail_fd3_Text":"@^^ Tomorrow is my favourite holiday - and for whatever reason, you absolutely cannot miss it. Every year on All Souls' Day I run inside that maze and explore it. The realistic monsters and eerie atmosphere are like being in a colony of wandering souls, as if you're about to be swallowed up by the bottomless Abyss in the next moment. From one fork in the road to the next, you never know if you'll be greeted by a scary demonic creature or a warm campfire, but I've never been afraid of the monsters in the maze. ^^ Except, of course, spiders. ^^ Abbie",
    "Abigail_fd4_Text":"@^^Who is your secret friend? Whoever it is, you'll want to prepare an elaborate gift, after all, tomorrow is a great opportunity to foster friendships with your friends. ^^ I'm not a big fan of the punch at the party, but the pumpkin soup is delicious and the Christmas tree decorated with lights is beautiful - but if I were to do the dressing up, I'd prefer ornaments with a touch of horror. ^^ See you at the festival. ^^Abby",
    "Abigail_h_Text":"@^^@, you actually saw all the text from the other night, didn't you? ^^ I was coming to apologize - but apologies are nothing more than cover for me, you weren't mad, it was just my desperate and ridiculous attempt to hide my own thoughts, but now I don't want to continue to hide it so much. I like you, @, not in a best friend kind of way, but I love you and want to be your lover and even your wife. Forgive my recklessness, @, but I'm writing you this letter without even knowing if you have a partner or someone you like, but I can't help but like you. ^^ I love you far more than anyone else in the world, and I am a hundred thousand percent sure of that. ^^Abby",
    "Abigail_hd_Text":"@^^ Thank you for the bouquet - although in an objective sense it was mine, it's nice to know that you feel the same way as I do. ^^ Actually, to be honest, even though I had probably guessed where things were going, I was overwhelmed the moment you pulled out the bouquet. Remember to add the word darling when you address me again in the future, haha. ^^ See you later. ^^Abby",
    "Abigail_hn_Text":"@^^ Well, @, you've got a lot of nerve - but I like that trait in you. Did you get permission from someone before you sent me flowers? I'm guessing no, otherwise you would have been disembowelled by now, or is it the thrill of guilt that you like? In that case, we're a match made in heaven, @. ^^ Don't forget, I wrote the letter to tease you, but you're the one who sent me the flowers, so don't try to expose me for something stupid. Hide this letter well, and don't let *that man* find it. We can kiss, hug ...... or make love in town, in the woods or even in my bedroom bed and *that person* won't know anything about it. ^^ How do you plan to hide it when someone has done a day's work around the house, made a hot dinner in their exhaustion, and ends up waiting until late at night for you to get home? Ah - maybe I should even leave a few lip prints on your body so you can protect them from *that guy* ...... I'm already excited as hell. ^^ Looking forward to you coming to me, don't let Pierre and Caroline find you. ^^ Abbie",
    "Abigail_hn2_Text":"@^^ You're such an idiot,@, I don't really know how to describe you - those two goddam brats who were playing hide-and-seek on your farm when I dropped off the love letter and they saw all of me kissing the envelope. ^^ I'm screwed now, Caroline is locking me up and confiscating my games console, and all because of your wife Penny. Why did you let those two kids in on your farm? I can't find any other suitable reason other than that Penny let them in. Now the whole town knows I'm an indiscreet girl and my life is kind of ruined by her. She's practically evil. ^^ Let me put it this way - you and I are now notorious in this town, but we are not without hope of salvation. If I become your official wife, then everyone in town will realize that the so-called rightful wife is an unwanted outcast, and I'm the final winner. ^^ Also, I don't know if you have any children, if you do, use this thing to get rid of them before you ask me to marry you, I'm not going to be a stepmother. ^^ Sweetheart, I remember when you called me *Little Abbie* from my pillow - I love you far more than she does, and you know best about that, don't you? ^^ Your little Abbie",
    "Abigail_di_Text": "Pelican Town West Farm To ^^Receiver @ ^^Address Pelican Town West ^^Contact SDV-W-F-1001 ^^Pelican Town Post Centre",
    
    //Haley
    "Haley_c_title": "To a friend",
    "Haley_l_title": "For my lovely friend",
    "Haley_d_title": "For my lovely lover",
    "Haley_e_title": "For my sweetheart",
    "Haley_di_title": "Pelican Town West Farm Collection",
    "Haley_crush_Text": "My best friend @^^ We had so much fun talking the last time we met that I ended up forgetting all about the gift I had for you, and this is for you. ^^ My unnamed parents finally wrote to me, and in addition to greeting Emily and I, they enclosed a bunch of souvenirs from the trip - I thought they'd forgotten they had two daughters in Pelican Town. ^^ Come and talk to me next time too! ^^Haley",
    "Haley_c1_Text": "My good friend @^^ In the spring I like to take my camera and go to the banks of the Mineral River to take photos, the woods and meadows there are great for framing. Also, sometimes I go to the town fountain, where at least there is no noise and the benches are quiet. I have tried to take a picture with the fountain but the water always comes out blurry. ^^ I love my little camera, but I wish I had a more professional camera. ^^Haley",
    "Haley_c2_Text": "My best friend @^^ I've just come back from the beach and the scenery never fails to impress me. On the beach I found all sorts of shells and small corals, which were washed very shiny in the waves. I chose the prettiest one for you. ^^ I could never understand why my sister liked sea urchins, but I brought her one back anyway. According to her, sea urchins seem to be a good natural purple dye. ^^Haley",
    "Haley_c3_Text": "My best friend @^^ My parents sent me back some honey and this is for you. ^^ According to my parents, the honey is called pine honey and they bought it when they were traveling in Turkey. It is probably much darker in colour than the honey we usually eat, but the good thing is that it is pure and natural, and it is said to have beauty benefits. ^^ Do you have a beehive on your farm? It should be a blessing to be able to eat your own handmade honey in late autumn. ^^Haley",
    "Haley_c4_Text": "My good friend @^^ Winter is such a hard season, isn't it? You can't work the land nor graze outside, so I'm afraid the farm income is going to be at a discount, right? ^^ I usually stay at home in the winter, with my annoying sister. It's a good thing my parents' house has two small separate rooms, otherwise it would be torture to live under the same roof with her. She always annoys me with household chores when I'm enjoying my free time and likes to play loud music in her room. ^^ I wish I could move out soon, ugh. ^^Haley",
    "Haley_love_Text": "To the lovely @^^ Time with you is always so fun, but always overly short at the same time. Since I met you, I've run out of my little Polaroid and I just can't get enough of the memories I have with you. ^^ I sometimes forget how long I lived in Pelican Town, I just remember that the Polaroid film stopped being made a long time ago. Then you came to Stardew Valley and I gradually remembered this slow-moving town and my own lazy life. ^^Haley",
    "Haley_l1_Text": "To the lovely @^^@, for you spring should be the season for planting seeds, right? I love spring, not just because it's good for framing, but the yellow daffodils blooming everywhere. ^^ I used to plant these yellowish flowers in my flower bed at the door, but unfortunately I always forgot to water and loosen the soil, and they either wilted within a few days of planting or refused to flower anyway, like a maverick weed. ^^Haley",
    "Haley_l2_Text": "To the lovely @^^^ You can probably tell from my sultry handwriting - Emily started playing her music again as soon as she got up this morning. I was planning on getting a beauty sleep and she nearly gave me a black eye. ^^ I tried to knock on her bedroom door to get her to turn the music down, but she couldn't even hear me shout. I had to go back to my room and cover my head with a pillow, hoping that Yuba or some other genie would hurry up and short out her stereo so my ears would be clear. ^^ Or I could just go hide on the beach, Emily never goes to the beach. ^^Haley",
    "Haley_l3_Text": "To the lovely @^^@, did the autumn harvest go well? My parents have written to me again, this time also about their journey - they have entered the Atlantic Ocean from the Iberian Peninsula and travelled south on a cruise ship via the famous Ivory Coast, landing in the port city of the Western Cape. The fluffy wool is abundant there, and the fabrics woven from it are smooth and silky to the touch. ^^Talk to you in person, @, I'd like to share more with you. ^^^Hayley^^^ Oh hi, @, my sister's mail was just returned by the post because it didn't have a recipient address. I filled in the address of your farm for her and by the way this fabric is for you so you can make clothes out of it and wear it. Blessings to you both, hahaha. ^^ Emily",
    "Haley_l4_Text": "To the lovely @^^ A good thing happened today, @, my sister finally got a job in the pub. ^^ The old Emily was a clever seamstress, but her business wasn't very good, so her sewing machine always sat idle. Then she simply stopped sewing and went into the dyeing and fabric business full-time. After all, the slightly older housewives in this town make their own clothes, but the coloured fabrics still need to be sold exclusively. ^^ Still, I think she liked working with people, so she ran off to Gus's and became a bartender. That's good, I finally don't have to listen to her nagging when I'm at home. ^^Haley",
    "Haley_date_Text": "To my lovely lover ^^^@, you have a heavenly surprise for me - the bouquet of flowers still smells delicate and fresh and sweet as I write this to you. I have cut their branches with branch cutters and put them in my little vase so that they will still bloom for a while. ^^ Ah, @, if I could see the future, I would have my Polaroid with me so I could capture your eager eyes as you delivered the flowers and your lovely smile when I received them. I'll keep them forever in my beloved little photo album, alongside my photos with Emily. ^^@, I am ecstatic to be your *sweetheart*. ^^Your Haley",
    "Haley_d1_Text": "To my lovely lover ^^ Do you make a habit of going for walks along the Mineral River? If so, perhaps you'll see me there. I'm standing right by the river, camera in hand, looking out over the flowing waters of the Mine River and the mountains in the distance. ^^ Spring here is good for framing, but I can't fit any more of the same old wilderness like this in my little album. But if you'd like to come, maybe there's a lot more interest in the scenery. ^^ Your Haley",
    "Haley_d2_Text": "To my lovely lover ^^ I've taken a lot of photos this spring, but very few of them satisfy me, probably because the sheer scenery is too boring for me. ^^ I would have to say a few of my favourites - this one is about the sheep Jas and Marnie have, the little girl gives me an alternative feeling. If Vincent is a standard country boy, Jas is simply too quiet to be a child. You can see her sitting frozen next to that sheep, one hand on its back and the other on her cheek, looking thoughtful. ^^ I don't know if you recognise this person in the other photo, her name is Leah and I took a photo of her with her sculpture. The subject of that sculpture appears to be a Roman soldier, with rough muscular lines and angular features, clutching a straight sword and shield in each hand - it's a good thing I was there early, she hadn't finished sculpting the upper half of her body yet, or this photo wouldn't be so easy to show... ...Anyway, it's the art side of things, you know. ^^ Your Haley",
    "Haley_d3_Text": "For my lovely lover ^^ I have a gift for you @, it's coffee beans my parents sent back from Malabar Harbor. I thought they would be back this summer, but it turns out they didn't head for America at all, but went east with the Indian Ocean currents. ^^ I'm here on the beach now and Willie has given me some sea salt - which he says is used to suppress the bitterness of the coffee. It's really nice to sit on the beach and watch the sunrise while drinking coffee. ^^ Your Haley",
    "Haley_d4_Text": "To my lovely lover ^^ I'm planning a trip to the mountains this autumn to take in the scenery and I want to see how the frosted leaves will look on camera. Apart from that I would like to find a few beautiful leaves to use as bookmarks. ^^ Yours truly Haley",
    "Haley_d5_Text": "To my lovely lover ^^^@, how are you feeling today? My head is killing me - Emily was working on her mixology recipe and I tried a glass of her experiment out of curiosity. According to Emily, the drink was made with freshly made cranberry wine as the base, blended with cane sugar and pumpkin juice, and put in small pieces of chopped yams. She called the drink *Autumn Harvest* and I - my tongue - did feel what it was like to be in the midday of autumn, basking in the sun on the farm. ^^ The biggest improvement for Emily in terms of bartending is that she at least has no room to regress. ^^Your Haley",
    "Haley_fd1_Text": "To my lovely lover ^^@, it's almost time for the Flower Dance Festival, have you been practicing your dance steps seriously? If not, forget about your cauliflower and green beans for now, I hope you grab the remaining three days to hurry up and practice. ^^ I've been the reigning Queen of Flowers for years and I'm not about to give way this time. I'll give you a goal - keep up with the music and my pace, don't break the rhythm, and I'll do the rest. ^^ Your Haley",
    "Haley_fd2_Text": "To my lovely lover ^^ What ingredients are you going to put in tomorrow's Baileys meal? It's been really hot this summer and I'm sweaty just from moving around, but I'm not averse to going to the beach if that's what it takes. ^^ I'm going to add a coconut to the soup, an ingredient that's practically made for summer. ^^ Your Haley",
    "Haley_fd3_Text": "For my lovely lovers ^^ To be honest, I feel a bit scared by All Souls Day, but I'm looking forward to the scary and spooky atmosphere. I've never been inside a maze before, the odd shouts would give me nightmares, and there's plenty of delicious food on the banquet tables outside. I just have to sit on the bench and enjoy the coconut wine and rhubarb pie. ^^ If you find anything interesting in the maze, remember to tell me about it! ^^ Your Haley",
    "Haley_fd4_Text": "To my lovely lover ^^ Do you want to know who my secret friend is? That's a secret that can't be told. ^^ The Winter Star Tree is getting pretty, I always wondered how Lewis managed to do it, the decorations on it never change every year. Did he get the decorations in Zuzu City? Or were the decorations all made by carpenters? I'm not really sure, he never talked about it either. ^^ See you at the festival to talk about it. ^^Your Haley",
    "Haley_e_Text": "For my sweetheart ^^ My sweetheart, @...... We are as sweet and refreshing as spiced mead, as if we were born to be in tune with each other's souls. I wasn't surprised when you pulled out the pendant, because everything was so natural for you and me. We are just too good for each other and if we don't come together, Yuba won't agree. ^^ I have to go and get ready for our engagement now, we'll have plenty of time to talk when we meet - oh no, when we live together. ^^ Your lovely wife Haley",
    "Haley_di_Text":"@receive^^ How nice of you to try to get ahead of me and propose, is that right? ^^ The pendant you gave me has been thrown overboard, don't let me see you again." ,
    "Haley_h_Text": "Here @^^^ wait - @, I know exactly what my sister said on her letter to you, she's been tuning the sound all morning. I - as your best friend, you must must must not come to her room, and even if you do, you must must not practice dancing with her in her room, I have a rare clear morning, please. ^^ See you later. ^^ Haley",    
    
    //Maru
    "Maru_c_title": "Pelican Town - 1 Intermountain Road - Robin's Store",
    "Maru_l_title": "Pelican Town - 1 Intermountain Road - Robin's Store",
    "Maru_d_title": "Pelican Town - 1 Intermountain Road - Robin's Store",
    "Maru_d3_title": "Pelican Town - Central District - Harvey Clinic",
    "Maru_e_title": "Pelican Town - 1 Intermountain Road - Robin's Store",
    "Maru_di_title": "Pelican Town - 1 Intermountain Road - Robin's Store",
    "Maru_crush_Text": "Pelican Town - Farm 1 West - @^^ I am writing to thank you for taking care of me, not only in terms of experimentation and work, but also in terms of life. You have really helped me out a lot. ^^The samples are going to be sent off for testing, so that's all I'm writing for now. ^^Pelican Town - Mountain Road 1 - Robin's Store - Maru",
    "Maru_c1_Text": "Pelican Town - Farm 1 West - @^^@, have you ever grown cauliflower? It's the crop with the long oval leaves and white flower bulbs. ^^ I especially like this vegetable because it is not only nutritious, but it is a great sample to experiment with in soil research and pest control. I like to drizzle hot cheese over the cooked cauliflower and then send it to roast inside the oven so that it has a rich, creamy flavour hanging between all the cauliflower bulbs. ^^See you later, @. ^^Pelican Town - 1 Intermountain Road - Robin's Shop - Maru",
    "Maru_c2_Text": "Pelican Town - Farm 1 West - @^^ In autumn the salmon migrate from the ocean to the small lakes in the mountains, so if you have a fishing rod you can take your chances in the mountains to the north. Remember to take your axe with you, the wild trees and undergrowth can get in the way. ^^ If you find any interesting specimens, send them to me. ^^Pelican Town - Mountain Road 1 - Robin's Store - Maru",
    "Maru_love_Text": "Pelican Town - Farm 1 West - @^^ Hi, @. I have a small gift for you as a thank you for taking care of me, you have helped me perfect a lot of my work by sending me materials and samples. ^^ This mineral is a little radioactive, but it's hard enough that it could probably be made into tools or something. Provided, of course, that you are able to smelt and purify them. ^^Pelican Town - Mountain Road 1 - Robin's Shop - Maru",
    "Maru_l1_Text": "Pelican Town - Farm 1 West - @^^ Do you know my brother? I just thought there was a chance you guys might get along. He doesn't really like to talk to me when I'm at home and always locks himself in the basement alone, working on his program code. ^^ That said, would you consider installing a computer on your farm? I could install some sensors to monitor the progress of your crops, hormone levels and pesticide levels in the greenhouse, that would definitely make your management a lot more efficient, but you'd have to figure out the computer part yourself. ^^ Pelican Town - Mountain Road 1 - Robin's Store - Maru",
    "Maru_l2_Text": "Pelican Town - Farm 1 West - @^^@, I'm writing to send you some quality building materials. The wood was originally an experimental strain that Demi and I planted a long time ago, but now they've completed their mission, so the best place I've delineated for them to go is to be turned into building material. ^^ Hope that helps, see you later. ^^ Pelican Town - Mountain Road 1 - Robin's Store - Maru",
    "Maru_date_Text": "Pelican Town - Farm 1 West - @^^ Your courage really blows me away, @, if only my brother was as outgoing as you. I actually like you too, I just rarely get the chance to write to you due to my busy schedule of experiments and work, and my ability to express myself is quite limited, I'm sorry. ^^ These are my latest developments, I hope they will be of help to you. ^^ Pelican Town - Mountain Road 1 - Robin's Shop - Maru",
    "Maru_d1_Text": "Pelican Town - Farm 1 West - @^^ I was expecting quite a few critical situations at the clinic, and I was worried about how well I would be able to handle them after being on the job for so short a time, but now I see that I was worrying unnecessarily. The people of Pelican rarely get sick and Dr Harvey asks the townspeople to come to the clinic every year for voluntary check-ups to keep them healthy. ^^ Actually the clinic wasn't doing too well in terms of revenue, after all there were very few patients here and there was no income from the voluntary check-ups. The good thing is that Lewis has applied for a health fund from somewhere, and with the taxpayers' money to support it, the clinic can at least be sustained. ^^ Pelican Town - 1 Intermountain Road - Robin's Store - Maru",
    "Maru_d2_Text": "Pelican Town - Farm 1 West - @^^^ Hi, @, Demi and I have just processed a sample batch of hares that have been flooding the area after the spring breeding season and there are no suitable natural predators in Stardew Valley to control their numbers. ^^ We started by catching a hundred and twenty hares, marking them and releasing them back into the wild, however when we caught them again, only three of the hundred and twenty were marked - a horrible number. ^^ But the good thing is, Demi and I put a virus that only works on rabbits out into the Stardew Valley countryside, which will help us cut their numbers. ^^ By the way, this lucky pendant is for you, the rest of it is being made into soup by me, haha. ^^Pelican Town - Mountain Road 1 - Robin's Shop - Maru",
    "Maru_d3_Text": "Pelican Town - Farm 1 West - @^^ With the change of season in autumn, the clinic is a lot busier than before, I've got some over-the-counter remedies for you, take care of yourself and don't catch a cold. ^^Pelican Town - Central District - Harvey Clinic - Maru",
    "Maru_fd1_Text": "Pelican Town - Farm 1 West - @^^ The Easter egg hunt is one of the great joys of this holiday season. After my research, there should be a total of 27 eggs inside the entire scene, and the majority of them are hidden away in very secret places. ^^ In terms of density, the eggs on the east side are more densely packed than those on the west side. If you draw a dividing line from the Jody's backyard fence to the shrubs in the Lewis's back garden, the eggs on the south side and the north side are about equal in number. However, given that the event starts in the town square, I would recommend that you head north-west first in terms of passable distance. I conducted several experiments and the maximum number you can get in the limited time available should be 18, provided there are no redundancies in distance or mistakes in collecting. ^^ Pelican Town - Mountain Road 1 - Robin's Store - Maru",
    "Maru_fd2_Text": "Pelican Town - Farm 1 West - @^^ The Dance of the Moonlight Jellyfish is a very rare event, the so-called dance is a metaphor used to describe a large group of jellyfish swimming and hovering in the shallow waters. Constrained by their simple structure, their movement is mainly driven by currents, and on the 28th day the periodic currents just happened to bring them to the shallow waters around Pelican Town. ^^ Moonlight jellyfish are somewhat phototropic and prefer lower light. During the day when the light is stronger, most of these jellyfish congregate in the lower and middle layers of the ocean, while at night as the light fades and the temperature in the lower and middle layers drops, they gradually move to the surface and shallow waters, so the moonlight jellyfish dance occurs mostly in the evening and even late at night. The lights we put down have the effect of repelling them, so it looks like the jellyfish are following the lights, but in fact they are being driven to deeper water by the light source. ^^ Investigating the population density of moonlight jellyfish can help assess pollution levels offshore in the Jewel Sea. ^^ Pelican Town - Intermountain Road 1 - Robin's Store - Maru",
    "Maru_fd3_Text": "Pelican Town - Farm 1 West - @^^ According to my research, the winter star that Pelican Town residents refer to would be Iridium. The metal is not yet as abundant in the earth's crust as it is in meteorites, and the amount of iridium present in the mines of Stardew Valley is really small, although the element seems to have affected the ecology around the town in some magical way. ^^ Judging from the crops on your farm, the higher the quality of the vegetables, the higher the iridium content seems to be - within the range of what is safe for humans, of course. I haven't yet figured out exactly what this element does to the growth of the crops, but I have found that it also has a certain effect on the human mind, a feeling like being happier when you receive an elaborate gift, although I suspect that this is actually some sort of hallucinatory effect from the iridium element. ^^ I don't think I've told you yet - the origin of the name Iridium actually comes from the shape of the irregular meteorite that landed in Stardew Valley, looking like the traditional five-pointed star. ^^ Pelican Town - Mountain Road 1 - Robin's Shop - Maru",
    "Maru_di_Text": "Pelican Town - Farm 1 West ^^ Our tempers do not get along, so there is really no point in staying together any longer either. I should have returned the pendant to you but the postal centre lost it in the post so there you go. ^^ Pelican Town - Mountain Road 1 - Robin's Shop - Maru",
    
    //Emily
    "Emily_c_title": "For my friends on the farm",
    "Emily_l_title": "For my friends on the farm",
    "Emily_d_title": "For my little farmer",
    "Emily_e_title": "For my little farmer",
    "Emily_di_title": "Pelican Town West Farm Collection",
    "Emily_crush_Text": "For the farmer @^^ Hi @, I've got a batch of soft wool for you, so if you have a loom you can weave your own cotton fabric. If you want to make clothes out of cotton, you can use my sewing machine - you wouldn't mind if I took your measurements, would you? hahaha. ^^ Emily the seamstress",
    "Emily_c1_Text": "For the farmer @^^ This gemstone has a compatible energy with spring and you can use it as a talisman. ^^ Human energy circulates with nature, our spirits are influenced by nature and the natural environment is interfered with by our actions. I give you a gift like that because I want you to feel the nature and to keep your mind and body happy after your farming days. ^^ Emily the Tailor",
    "Emily_c2_Text": "For the farmer@^^ Don't get heatstroke in the summer when the sun is so hot on the farm. These coffees are for you. ^^ The summer breeze from the Gem Sea is rich in energy and I can feel its heat in front of my sewing machine, mixed with the smell of berries and pea flowers. If you look around, you might find something interesting. ^^ Emily the seamstress",
    "Emily_c3_Text": "For Farmers@^^ The energy of autumn is like citrine or pumpkin, with a slight whiff of ripeness. ^^@, what do you do in the fall? I occasionally sell some fabric to the town and sometimes I get orders for tailoring winter clothes, but mostly I'm idle, so idle that I want to find something to do. I'll be bartending at Gus's bar in the evenings, so don't forget to come and see me if you're planning on going to the bar. ^^ Emily the Tailor",
    "Emily_love_Text": "To the farmer @^^ I had fun writing to you, after all I haven't communicated with anyone in writing for a while. My Schrödinger parents only send us a letter back for over six months and we don't even know how to write back to them, and even if we did, we wouldn't know where to send it. ^^ Having a sister at home is a bit of a nuisance, but by and large we have a good relationship and it's no trouble to look after her. I wonder if you have any siblings? ^^ By the way, these are the things my parents sent back and I hope you'll take them. ^^ Emily the Tailor",
    "Emily_l1_Text": "For the rancher@^^ This spring I'm going to find time to go to the ranch and buy some good quality wool and rabbit fleece to come back and use for fabric. ^^ Do you know how to use a dye pot? Dyeing fabric is a very complicated discipline. I can explain to you briefly how it works - to use a dye bucket, you first need to have all the *pigment* which can come from vegetables, fruits, minerals and even anything with colour, which the magic of the fuel jar will transform into fluid pigments; secondly, you need to have a piece of clothing which you can use to dye. Secondly, you must have a garment that can be dyed, which must be made of natural cloth and never dyed on a technological level; then you can put the garment in the tank and adjust its colour to your liking; and finally you will have a garment that you love. ^^ I'm sending you a few copies of a good quality blue dye with this letter, we'll talk about it when we meet. ^^ Emily the Tailor",
    "Emily_l2_Text": "To the farmer @^^ The sunflowers I planted in my backyard are in bloom, this one is for you, sunflowers are a great quality yellow dye. ^^ You can also try to make oil from it, but corn is better for cooking oil. ^^ Emily the Tailor",
    "Emily_l3_Text": "To the farmer@^^ I found some collard greens in the fridge to go with the amaranth from the autumn harvest and the salmon from Mineral Lake to make a dish, try it. ^^ I learnt the dish at Gus's, I hope I'm not too bad at it, after all Hayley always said I used strange ingredients, but she had a good time eating it. ^^ Emily the Tailor",
    "Emily_date_Text": "For my little farmer ^^ It's the first time I've received such an intimate gift - but to be honest, I love the flowers, I get your sentiment, thank you, @. Actually, you and Hayley should be sort of the same age, but maybe you like having an older sister? In that case we'd fit in quite well unexpectedly. ^^ I've attached some bright and fiery red dye to you, just like your love and mine, hahaha. ^^ Your good sister",
    "Emily_d1_Text": "To my little farmer ^^ How are you today? Caroline sent me some tea bags and I sent some to you with the letter. ^^ Long hours of sewing can make my eyes water, and a good cup of tea can make them bright. If things on the farm make you feel exhausted, sit down with a cup of tea and take a rest. ^^ Your good sister",
    "Emily_d2_Text": "For my little farmer ^^ It's a humid and hot summer in Stardew Valley, and the whole valley is like a big steamer, making you sweat as soon as you move. I've got a few bottles of tonic water for you from the drawer, if you're too tired just drink one and you'll be much refreshed. ^^ Your good sister",
    "Emily_d3_Text": "For my little farmer ^^ How does it feel to be a farmer? Autumn is a busy time for farming, so I guess you're busy now. ^^ I've got some vinegar for you this time. To be honest, I thought about giving you something nutritious like milk or eggs at first, but those things are usually available on the farm, but you can't make your own vinegar. You could use vinegar in a salad or in a herb soup for a healthy and positive energy boost. ^^ Your good sister",
    "Emily_fd1_Text": "For my little farmer ^^ Hi @, come and be my dance partner at the Flower Dance Festival? I can teach you how to dance, I have a little speaker in my room. ^^ To be honest, this festival was slightly embarrassing for me before you came, after all I'm a few years older than Hayley and most of the young guys in town are younger than me - plus to be honest I'm not very good at dealing with them. ^^ I'm going to start practicing my dance steps, see you at the festival. ^^ Your good sister",
    "Emily_fd2_Text": "To my little farmer ^^ The appearance of moonlight jellyfish is related to something called a moonlight pearl, which may sound hard to understand, but it doesn't have to be. All you need to know is that the energy that this stuff has is attractive to moonlight jellyfish. ^^ Moonlight jellyfish are mostly pink hemispheres, but if you look closely you will also find very rare blue individuals inside, which is a special variant. If you can find a mage at the festival he might be willing to tell you more about it. ^^ Your good sister.",
    "Emily_fd3_Text": "To my little farmer ^^ I'm a little curious as to what you'll be exhibiting at the festival, but as far as I can see, at least six of the nine items must have different kinds of energy. You can choose from six things - vegetables, fruit, custard, artisan products, minerals and wilderness gleanings - or you can try other combinations. ^^ You can also try your luck up the Mineral River in the next two days and if you catch a very rare fish, it will also add to your display case. ^^ Your good sister",
    "Emily_fd4_Text": "For my little farmer ^^ What's Christmas like in town? When it's time for the Winter Star Feast, the whole town gathers in the town centre square to exchange gifts, talk or dance and sing under the feast tree. If you're hungry, there's grilled fish and pumpkin soup, and if you're thirsty, there's light beer and corn juice. Joy is always the main theme of this festival. ^^ I wonder how that Christmas tree, so beautifully dressed? ^^ Your good sister",
    "Emily_e_Text": "To my little farmer ^^ So, we're officially family now? That's nice, @, and the necessary rituals always stir up a lot of joy and sweetness in our lives. I am probably more suited to being a sister than a wife, but I will still love you as a companion. Our energies are in tune with each other, as if everything was meant to be. ^^ And, if I moved out of that house, Haley and I would have a much better relationship, hahaha. ^^ Your good sister & good wife",
    "Emily_di_Text": "To the farmer @^^ We really can't get along after all, @. My relationship with you is like a carbon copy of mine and Hayley's, and although we love each other, the endless bickering has eventually led the unrelated to us to dispersion. ^^ Don't come looking for me, @, you're making me really sad. ^^Emily",

    //Elliott
    "Elliott_c_title": "To my best friend - Elliott",
    "Elliott_l_title": "To Best Friend - Elliott",
    "Elliott_d_title": "To Darling Elliott",
    "Elliott_h_title": "To Dear Elliott",
    "Elliott_e_title": "To Dear Elliott",
    "Elliott_di_title": "To a former companion - Elliott",
    "Elliott_crush_Text": "To a good friend ^^@ - I suddenly thought of you in my spare time writing, so I went to the trestle by the jeweled sea and wrote you this letter to the sound of the seagulls and waves. ^^ I cannot see your fields from here, just as I cannot see if there are still valleys and towns like ours on the other side where the sea and the sky meet. To the song of Britannia I fall asleep and wake up, occasionally casting my fishing line into the waves - sometimes seaweed, sometimes flounder. There are endless words bound by letters, while the sound of the waves can reach to endless distances. If you would like to come to my hut again, I will talk to you more. ^^ Elliott",
    "Elliott_c1_Text": "To a good friend ^^@, I hope your life on the farm is going well. Spring is a time of budding inspiration and I will be taking a walk inside the town to see how people are spending this spring. ^^ Some people will be more outgoing and happy to share their lives with you, while others will be slightly shy and need you to show a keen interest in them at all times. The other side of writing is also the art of telling and communicating, and if we have had enough experiences, the simplest of stories will not be boring. ^^ Elliott",
    "Elliott_c2_Text": "To a good friend^^ Life is so different here than in the city and I'm glad I came to this place and experienced it first hand, an experience that can never be portrayed behind closed doors. You can certainly replicate a magnificent Hagia Sophia in Asmara, but the Greeks' new Rome is ultimately by the sea in Marmara. ^^ Hope to see you soon. ^^Elliott",
    "Elliott_c3_Text": "To a good friend ^^ One advantage of living by the sea is that there is neither the unbearable heat nor the rising and falling cicadas. ^^ I like to push the piano onto the beach and play music while blowing in the humid, sultry sea air. The seagulls around the hut are my only audience, though most of them only come to steal the dried fish I hang outside. I feel some days that even if my desire to express myself is strong, the lack of people to express it to troubles me. ^^ Elliott",
    "Elliott_c4_Text": "To a good friend ^^ I left the beach after a long absence and went to the woods on the west side of town, looking for new inspiration near the Mineral River. The usual sound of pounding plaster came from Leah's cabin, which reminded me of the morning she had come to the beach and hung a painting on the wall of my cabin. I had looked at that painting for a long time, and in the end, after countless thoughts I came to the conclusion - I really had little talent in understanding modern art. ^^ I just looked at your farm from the river bank and a natural longing came over me. ^^Elliott",
    "Elliott_c5_Text": "To a good friend ^^This should be the last letter I write to you this year, @. ^^ In the remaining days of autumn, and in the winter that follows it, I will spend countless leisure hours jotting down the stories I have collected. I may write sprawlingly for days, or I may suddenly fall into the odd musing at some point, it couldn't be further from the truth. When you're inspired, you always think you can write, but when your inspiration wears off, you start to get lazy. ^^ That's why it takes me so long to work. ^^Elliott",
    "Elliott_love_Text": "To the Best Friend ^^It's as if I've seen mermaids on the Jewel Sea, trailing their emerald scales, frolicking and chasing not far from the beach, their long hair brushing the waves reminding me of the lustre of aquamarine. ^^ I love writing with all my heart, just as people are born with a passion for the far and unknown. Everyone can be a writer of their own life, the difference is whether that person is willing to put love and passion into the people and things around them, whether they are willing to get in touch with the beauty and ugliness of the world, or whether they are willing to think for themselves about how they should live, rather than listen to the words of their parents, their teachers or just anyone. ^^ I think you've understood the meaning of these words if you've moved to Stardew Valley. ^^Elliott", 
    "Elliott_l1_Text": "To my best friend^^ The sun, the bright sun of spring, the father of light and passion - when I look up to the sky, the sun's bright and dazzling flames make me involuntarily want to avoid his majesty; while when I lower my head and set my eyes on the meadows strewn with wild flowers, the sun I was so happy and kind. I marvelled at the great power of the sun, likened it to an extraordinary father, and treated him with childlike awe and affection. ^^ The sun has given me a wealth of inspiration and the endless business of the fields. It is with gratitude that we should pay him high homage. ^^Elliott",
    "Elliott_l2_Text": "To my best friend ^^ When I look through books that bear wisdom, I always feel a deep sense of longing for those distant lands and peoples. On the one hand, I marvel at the magnificent artistic and cultural treasures that human civilisation has produced, while on the other hand, I sigh at the ignorance and ignorance of modern man when it comes to history. ^^ Over the millennia, countless mistakes have been made and a great number of horrific tragedies have been perpetrated. I don't know why a group of people who don't know each other have to fight each other to the death and blood just for something that will never really be theirs. Why do they fall in love with people who have never shown them kindness, and why do they hate people who have never hurt them? Simply because they were drawn into scattered groups by national borders? ^^ The point of remembering history is to reflect and correct mistakes, to create a better and peaceful world for people step by step. I don't want a group of people to pick up a history book years later, after a long absence, just to count the hatreds with each other or to obscure the crimes of their ancestors, so that poor soldiers can bleed again for the ambitions of the devil and the loved ones of the dead can shed tears for the needless sacrifices. ^^ Elliott",
    "Elliott_l3_Text": "To my best friend ^^^ I got into writing because I wanted to see more of the world as most people see it and put their world into words. I don't want the silent majority to become an existence that can only be represented by a code word in a government document, a string of numbers in a history book, they are the majority of the world. ^^ God says heaven belongs to the poor - great, that sounds great, but can't these people have a piece of the world? All they need is a small warm flame to bring a warm and dazzling sun to the world. ^^ Elliott",
    "Elliott_l4_Text": "To my best friend^^ It's still really hot these days, so hot that I can't bring myself to write, I can't even write letters. ^^You should take care of yourself in the fields and be careful not to get heatstroke. ^^Elliott",
    "Elliott_l5_Text": "To my friend ^^^ O autumn, bitter autumn, you suffer pain and suffering. ^^ The sands have renewed their fury, and only we fight for you. ^^ O fate, song of suffering, song of mourning. ^^ From the Black Sea to the Bering Sea, antipodean brethren are in the heart's nest. ^^ Though there be no clouds of spring in the sky, our love will surely save you from the plague. ^^Elliott",
    "Elliott_date_Text": "To my dear ^^ Your courage amazes me, my dear @. It's as if one second I was playing a soaring march and the next I received a bouquet from you, my feelings were first surprise, then admiration and pride in your courage, and finally transformed in words into a strong love. ^^ Please come and see me more often, I'm about to go mad with the thought of you. ^^Elliott",
    "Elliott_d1_Text": "To my dear ^^ Although winter is over, this opening spring is still slightly crisp and cold on the beach. The snow on the beach is gradually melting, the gravel and pebbles in the tidal pools are becoming clearer, and I can find some more half-cut coral trees or nondescript bird clams and oysters at the other end of the bridge. ^^ As soon as it was light, Willie took the boat offshore. I was about to pick up my dormant fishing rod for the winter and go fishing on the bridge for breakfast when I saw him pulling back near the dock. The boat had been moored for a whole month in the prolonged cold, and the purpose of his trip was to check that his old friend was still available to accompany him on the sea. Afterwards, we drank some iced vodka in the salty, cold sea air, which would be the start of my year of inspiration. ^^ Elliott",
    "Elliott_d2_Text": "To my dear ^^ I've captured a new inspiration, my dear, near your field. The reflections of the flourishing flowers in the mineral lake look like Ophelia falling into the water and I can't wait to get back and write these down. ^^ Thank you for the fields, dear. ^^Elliott",
    "Elliott_d3_Text": "To my dear ^^ I'm going to go out on the sea to catch some fish or just purely look at the scenery before the hot winds come in all over the place. ^^ In the summer months, red mullet and puffer fish come offshore in the Jewel Sea, and occasionally a few large tuna are seen. Lobsters and crabs are also said to be lurking at the bottom of the water during this season, but I haven't caught any yet. ^^Elliott",
    "Elliott_d4_Text": "To my dear ^^ When I woke up today, I noticed that the dried fish I had hung out on the shelf were missing, perhaps a thieving gull had stolen them. ^^ Living by the sea is both romantic and hard work. The beach is not just seaweed, birds and clams, fishing boats and vodka, but also wood that is gradually rotting from the humidity and thieving gulls that are always hovering over the rooftops. ^^ But there are two sides to everything in the world, and I'm pretty much used to it. ^^Elliott",
    "Elliott_d5_Text": "To my dear ^^ Dear, I'm going to start consolidating all my inspirations and stories from this year. This town is small and people don't have a lot of experience, but as I once said, a true writer doesn't get bored with anyone's story. ^^ Dear, please do let me know if you get any inspiration for the autumn harvest, in the end I don't seem to know enough about you. ^^ Elliott",
    "Elliott_d6_Text": "To my dear ^^ I was wondering if you would be surprised, after all this is the first time I've written to you in winter. ^^ As an aside - Willie and I caught a lobster in the icy waters with the crab cage and this is just for you. Logically I shouldn't have to stop what I'm doing to do these things like fishing and crabbing, but the long hours at my desk are making my back sore and I can't resist getting out for some air. ^^ Good health to you, @. Always drink vodka on the rocks, haha. ^^ Elliott",
    "Elliott_fd1_Text": "To my dear ^^ I was very impressed with the punch and antiphlogistic herb soup at Easter, and the eggstravaganza didn't really interest me. Rather than enjoying the festival, I enjoyed documenting what people were doing at the festival. ^^ I'll see you at the festival, dear. ^^Elliott",
    "Elliott_fd2_Text": "To my dear ^^ Who are you going to dance with at the Flower Dance Festival? I don't really have to ask, love will make us make the right and only choice for each other. ^^ Music and dance are sisters, I love music and I love dance. If I could dance with you, it would be a memory I would never forget. ^^Elliott",
    "Elliott_fd3_Text": "To my dear ^^ Moonlight jellyfish are truly a magical creature. I've tried to attract them with the light from the hut, but I don't know if the light is too dim or if my footsteps startle them and they swim away as soon as I get close. ^^ Or is there some unknown mystery to that boat light? It's really puzzling. ^^Elliott",
    "Elliott_fd4_Text": "To my dear ^^ All Souls' Day is one of my favourite holidays - although I refuse to believe that mythical monsters exist in this world, it's still fun to observe the dummy figures made by Lewis. ^^ These figures come from a general perception of monsters that has been formed over time, and behind them reflects an instinctive human fear, or rather a materialisation of that fear in a particular cultural context. I wanted to know the cause of this fear and the part of it that was behind it in relation to the history of civilisation. ^^ Elliott",
    "Elliott_fd5_Text": "To my dear ^^ Leah's aesthetic has always been great, as have the crafts and small decorations she makes. Since her arrival in Stardew Valley, Lewis has given her and Robin the job of decorating the Winter Star Tree, and I have to say that both of them are not bad at woodcraft. ^^ It's like I can smell the pumpkin soup and spiced punch already, they're on the feast table - I'm going to ask Willie for a cold vodka and look forward to seeing you at the festival. ^^ Elliott",
    "Elliott_h_Text": "To my dear ^^ What a coincidence, my dear @, I didn't realise you also had a unique love of contemporary music. Did Sam invite you to the concert? I think so, but that's nothing. If I was going to have a book signing, I'd have my best friend come and support me too. ^^ Similarly, Sam invited me and Leah to the concert, but the girl was so capricious that the slightest bit of moving rhythm made her whole body shake. My impromptu dance seemed to inspire her so much that she asked if I would dance with her - you know me, @, I didn't want to hurt a simple girl's love of music. After much hesitation, I finally decided to dance a dance of friendship with her, like the townspeople at a festival, which is common in literature and poetry. It is not an unforgivable sin for people to want to live a little more ideally. ^^ Of course, my dear, I am now aware of how much I have embarrassed you by my behaviour, but I fear again that my explanation will only stain a piece of our immaculate love. I reflect again and again and hope that you will forgive me for my folly and insolence. ^^Elliott",
    "Elliott_e_Text": "To my dear ^^ Your courage and love have once again bowled me over, my dear. I would be honored to accept your affection and become your husband. ^^ I will sleep today listening to the sound of the waves as a farewell to this familiar beach. Beyond the trestle, Willie's fishing boat once again sailed offshore, where the moon was just rising from the sea, still dripping with jewel-like droplets. ^^ Elliott",
    "Elliott_di_Text": "To Past Mates^^ As things stand now, it seems we have both done something that we regret to each other, but I don't reject the outcome, after all, if a boat has so many holes that it can no longer be repaired, then it is clearly a self-defeating thing to continue to let it battle the waves. I had gone back to my cabin, so if there was something what I had left behind, there was no need to send it to me specifically, just throw it all overboard. ^^ Willie and I set out once more on the fishing boat out to sea. The sun was not on our side today and the sea breeze on the boat was especially icy. ^^ Elliott",
    
    //Sam
    "Sam_c_title": "For my friend - Sam",
    "Sam_l_title": "For my friend - Sam",
    "Sam_d_title": "For my lover - Sam",
    "Sam_e_title": "For my lover - Sam",
    "Sam_di_title": "Letter from Sam",
    "Sam_crush_Text":"@^^ Oh hi @, I'm writing this letter to say thanks. You know, I'm usually kinda busy on my own, but your help to me was very much appreciated. ^^ There's a package at the bottom of this letter, and I've got something for you. I don't know if it's been crushed, after all I'm not too sure about the Fingal postman's work ethic. ^^Sam",
    "Sam_c1_Text":"@^^ When I picked Vincent up yesterday, he was telling me all the way about your farm and how he and Jas were lying on top of the fence looking out over the crops and animals on your farm. The children seemed so curious about your farm. ^^ How hard it must be to maintain such a beautiful farm? ^^Sam",
    "Sam_c2_Text":"@^^ In the summer I check my instruments to make sure the guitar strings and keys made of metal don't rust, after all the dampness here is so annoying. ^^ Your job on the farm too, don't work too hard in the hot sun and remember to always take some juice or something to prevent dehydration. ^^Sam",
    "Sam_c3_Text":"@^^ Although I have a bunch of chores to take care of at home, I actually secretly have a vision for music. Me, Sebas and Abigail had a little band and occasionally we'd get together and rehearse, maybe one day we'd even get to play on stage. ^^ But the *brutal* truth is - Vincent got another home visit from Penny and I had to rush home from rehearsal immediately. I hope the boy hasn't made any mistakes of principle. ^^Sam",
    "Sam_love_Text":"@^^ I've got something for you in the package below. Hope it helps. ^^ I'm still not very good at sharing what's on my mind with others, but I don't think it would hurt to share it with a good friend like you. Sebas helped me a lot before you came to Stardew Valley, and now you've reached out to me again, and I'm grateful to you all. ^^Sam",
    "Sam_l1_Text":"@^^@, is everything still going well at the farm? ^^ I'm getting mad at Vincent, really. Whenever he makes a mistake at home, he's always gone in a flash, and finding him is more work than catching a hare. But that couldn't be helped, after all, it wasn't like Jody had time for him. ^^See you later, @. ^^Sam",
    "Sam_l2_Text":"@^^In the summer Vincent stays at home most of the time, after all it's too hot outside and I'm afraid he'll run out and get heatstroke. ^^^ Jody was in charge of things around the house all by himself, while Vincent was in the care of the Lord and I. He never quite understood Kent's - and my father's - condition at the moment, and it was a hard thing to hide from a resourceful little boy. ^^ There were times when things at home always exhausted me. As hateful as the foreigners the media declared to be foreign enemies were, I always felt there was someone else to hate. ^^Sam",
    "Sam_l3_Text":"@^^ I sent you a package just under this letter. ^^ Well - it's frozen, but at least it doesn't contain any fruit ingredients. Except, of course, tomatoes. ^^Sam",
    "Sam_date_Text":"@^^^ Ha, @, I didn't think you'd get out of this first, I was kinda surprised. ^^ Back on topic - well, I'm not very good at expressing such feelings, but I love you too, dear @. This bouquet is for you, may joy and happiness be with us always. ^^Sam",
    "Sam_d1_Text":"@^^ What do you usually plant in the spring time, I don't know much about things on the farm yet. What crops are good for the season? Rhubarb or tomatoes? I've never experienced a self-sufficient life, I basically buy things online or go to JOJA supermarkets. ^^ Maybe it's good to go back to basics sometimes. ^^Sam",
    "Sam_d2_Text":"@^^ In the summer I occasionally go to Gus's and play pool with Sebastian and buy a few cold cans of coke. It's just too hot here in the summer, so it's good that the bar still has the cold air open. ^^ Well - it seems Abigail goes there occasionally, but I forget what she's here for, but one more friend is better than one less, haha. ^^Sam",
    "Sam_d3_Text":"@^^ I've heard that Linus actually made the labyrinth for All Souls' Day, and that every late autumn he works in the dark to keep it as secret as possible. ^^^ Jody never let Vincent into the maze, maybe out of protection for the little ones, but to be honest, Vincent will need to face things on his own one day. ^^Sam",
    "Sam_fd1_Text":"@^^Ah - by the way, tomorrow seems to be the Flower Dance Festival. It's actually quite a pointless festival, but I'm looking forward to it if I get to see you. ^^ I've tried using all sorts of excuses to get time off with Lewis before, but he's always caught me out every time. He has an unspeakable adherence to tradition, which is actually understandable; it's like the feeling of an old man who doesn't want what he has experienced to die out. ^^ About the former dance partner - no, I don't really want to bring it up, although she quite enjoyed the dance, but I forced myself to be embarrassed every time. ^^Sam",
    "Sam_fd2_Text":"@^^ In my eyes, the party was like a gathering between friends, and it was nice to meet and chat with Sebas and all that, from that perspective. ^^ As for the governor - I once put a pound of anchovies in the soup and all that came in return was that I ranked at the top of the town for community service hours, other than that I wasn't the least bit impressed with him. ^^Sam",
    "Sam_fd3_Text":"@^^ I have an appointment with Sebas to meet at the show tomorrow, the various games there are quite interesting. ^^ If your exhibit stands out, Lewis will give you plenty of star coins as a reward. I'm sure your farm produces some of the best vegetables and fruit in Pelican Town. ^^Sam",
    "Sam_fd4_Text":"@^^ I usually stay with my family during the feast, after all it's one of the few days I can bond with them. If you're feeling lonely on your own, come over to our side on the feast, my family loves you. ^^ Oh - and I need to hurry up and wrap a few presents for Vincent before he gets back, so that's all for this letter, see you on the holidays. ^^Sam",
    "Sam_e_Text":"@^^Ah - sorry, @, my mind just went blank and I forgot all the words that came to my mouth. I wanted to say that I love you just as much dear @ and thank you for the mermaid pendant, I will treasure this treasure forever. ^^ This gift is for you, it represents my best wishes for our future. ^^Sam",
    "Sam_di_Text":"@^^ Oh, hi, @. Even though we're okay now, there's one more thing I'd like to ask you, don't tell Vincent about this if possible, I don't want him to have any preconceived notions about marriage at a young age - I know I shouldn't have to ask that, but at least stand up for the kids, okay? ^^Sam",

    //Shane
    "Shane_c_title": "To a friend - Shane",
    "Shane_l_title": "For my friend - Shane",
    "Shane_d_title": "To my beloved farmer - Shane",
    "Shane_e_title": "To my beloved farmer - Shane",
    "Shane_crush_Text": "To @^^ I'm not much of a letter writer, @, and the most I've ever written in my life is the signer on the package and the price tag on the shelf. See you. ^^ This one is for you - it's on the Pro Futures shelf, but nothing should go wrong. ^^ Shane",
    "Shane_love_Text": "For a friend @^^ My friend - first time I've ever said that, @, you've made me feel like a friend in a long time. ^^ Well, enough with the granny talk. I've got something for you, which I got from JOJA supermarket *in stock*. ^^ Although I know it's not good behaviour, Maurice has owed me for months, so I don't really feel guilty about it. ^^ Shane",
    "Shane_l1_Text": "To a friend @^^ I'm currently working at JOJA supermarket, but it's more of a squeeze than a job. But at least I'm happy when I write to you, and that's okay. ^^ I've got something for you, @. I've got to get back to work soon or Maurice will come and dock my wages again. ^^See you later. ^^ Shane",
    "Shane_date_Text": "To my beloved farmer - Shane ^^ Thank you for the flowers, @. I should logically be the one to take this step first, but I'm still afraid of losing a precious friend while not getting an emotional response, but that doesn't matter now. ^^ Well, that's all I came to say, see you later, @, I love you. ^^ Shane",
    "Shane_d1_Text": "To my beloved farmer - Shane ^^ Winter is over and I can open the coop fence door again and let those chickens have some fresh pasture. ^^ As for me, it hasn't been a bad year, at least the spring was not too bad I guess. Jaz has been cooped up in the house all winter and it's time to take her out for some fresh air. ^^ Shane",
    "Shane_d2_Text": "To my beloved farmer - Shane ^^ What are your plans for the spring? We're both sort of living on the farm now - the difference is only that you tend the crops and I tend the animals. ^^ It's a relief to me that Jas isn't afraid of animals and I can teach her all about raising chickens. She knows her stuff and is a good learner, and Mrs Penny often praises her schoolwork, and if her real parents were still around, they would - oh, that's a long way off, sorry. ^^ I take Charlie out for walks occasionally, it helps improve her mood. ^^ Shane",
    "Shane_d3_Text": "To my beloved farmer - Shane ^^ Spring is almost over, @. By the time summer rolls around, Stardew Valley will have had a period of rain and the pasture will grow crazy fast. Always keep an eye on your animals to make sure they don't eat all the forage and don't starve them. ^^ If you're afraid that the animals will eat all the roots, you can fence off the grass - it's so hardy that it will continue to spread even if it's fenced off, and the animals won't be able to eat the grass under the fence. ^ ^ Shane",
    "Shane_d4_Text": "To my beloved farmer - Shane ^^^ I really don't feel much like going out in this sunny daylight, but I still feel the need to get out and let off some steam. ^^ I used to be just too self-conscious, and I felt I needed to improve that situation myself, or at least not give Jaz a bad name. That child is becoming more and more like me, I need to take her out more often. ^^ Shane",
    "Shane_d5_Text": "To my beloved farmer - Shane ^^^ The rainy season is here, @, remember to check the roof of your farmhouse, it's easy for a roof in disrepair to leak. Don't forget to take an umbrella with you when you go out, it's hot and humid, but you can catch a cold if you get your hair wet. ^^ By the way, if you are really unsure, you can go to Robin the carpenter in the hills to the north, she fixes all the houses in town. ^^ Shane",
    "Shane_d6_Text": "To my beloved farmer - Shane ^^ The weather has finally cooled off again, this season is my favourite, @. The valley is full of the aroma of wheat and the freshly brewed beer is probably on the delivery truck already - hmmm, I should probably give up drinking for a bit, Jas doesn't like me drinking. ^^ Well @, now it's time for me to get Jas to class, see you later. ^^ Shane",
    "Shane_d7_Text": "To my beloved farmer - Shane ^^ Are you busy with the autumn harvest? I'm guessing it's pretty busy, so I'll keep it short. ^^ This parcel is for you, @, and there's some cheese in it, made by Marnie herself. See you later. ^^ Shane",
    "Shane_d8_Text": "To my beloved farmer - Shane ^^ It's turned a bit cooler recently, don't forget to add a coat. ^^ In a couple of days it will be All Souls Day and there will be delicious pomegranate wine at the festival. Although the maze is the highlight of that festival, I'm not really interested in it though, it's Jaz who keeps wanting to go in. I wonder what the surprise is at the end of that maze? ^^ Shane",
    "Shane_d9_Text": "To my beloved farmer - Shane ^^ If you had a heater it would make the animals a bit more comfortable in the winter. Can't graze outside in winter and have to eat hay, not really to their liking but it can't be helped. ^^ I'm off to check the insulation, see you later, @. ^^ Shane",
    "Shane_d10_Text": "To my beloved farmer - Shane ^^ It's almost New Year's Eve, @, and I'm still wrapping presents for Jaz. She's been looking forward to this holiday for a long time, after all, she's been confined to the house this whole winter and it's normal for kids to love to play. ^^ By the way, I've got a present for you too. ^^ Shane",
    "Shane_fd1_Text": "For my beloved farmer - Shane ^^ I don't really like the Flower Dance Festival, but if it's a dance with you, I'm kinda looking forward to it. ^^ After all, I'm not much of a people person and Emily is overly enthusiastic, so I've had some pretty awkward flower dance festivals in the past. ^^ Shane",
    "Shane_fd2_Text": "To my beloved farmer - Shane ^^ I've prepared a bottle of mayonnaise and it will certainly go well with the Baileys meal. ^^ There's sure to be many kinds of delicious fruit wines at tomorrow's feast, I can hardly wait @. Hope to see you at the festival. ^^ Shane",
    "Shane_fd3_Text": "To my beloved farmer - Shane ^^ What all are you planning to exhibit at the show tomorrow? Marnie and I are going to put some mayonnaise and cheese on it, and a couple of pliable fabrics. ^^ It would be nice to win star coins and I'm going to trade them for a few air-dried sunflowers to take back and put in the henhouse. ^^ Shane",
    "Shane_fd4_Text": "To my beloved farmer - Shane ^^ Tomorrow is the Winter Row Feast, @, hope to meet you. Come up to mine and Marnie's side of the festival, just in time for the crowds to be a bit lively. ^^ Shane",
    "Shane_e_Text": "To my beloved farmer - Shane ^^ Would you like to marry me? Well, I lack a certain amount of mental preparation, but I still have the confidence to be a good husband. ^^ As you can see, I'm not very expressive, and in terms of ability I can only raise chickens, plus I occasionally drink a lot of wine, so I'm actually quite surprised - that you don't mind me. If I hadn't met you, I probably would have ended up on that rainy day. ^^ Take it, it's a gift I got for you from an old sailor. According to him, it's a treasure from the sea. ^^ Shane",
    
    //Sebastian
    "Sebastian_c_title": "Letter to a farmer-Sebastian",
    "Sebastian_l_title": "Letter to a friend-Sebastian",
    "Sebastian_d_title": "Letter to my love-Sebastian",
    "Sebastian_e_title": "Letter to my love-Sebas",
    "Sebastian_di_title": "Letter to a farmer-Sebastian",
    "Sebastian_crush_Text": "To @^^ I'm writing to make sure that everything is still going well on the farm? ^^ Actually, I don't think I should have to worry about your abilities, but I still felt the need to confirm. Well, see you later. ^^ Sebastian",
    "Sebastian_c1_Text": "Here @^^ What are your plans for the spring, @? I'm just slightly curious as to what someone who stays in the habit of going out all year will be doing. ^^ Even if it's a walk, I like to go where there are no people. Up in the mountains to the north, by the weathered railway tracks, it's a lot more peaceful than home. Occasionally when it's necessary to go to town, I usually choose to go to Gus's, but I wouldn't be much in the mood if you weren't around. ^^ Sebastian",
    "Sebastian_c2_Text": "Here @^^ The rainy season is almost here ah - the frogs in the valley should be coming out from inside the pond. ^^ Do you mind if I keep frogs? I just wanted to know your opinion on the matter. I used to have a frog when I was little, but Robin lost it, she was scared of the thing. ^^ Sebastian",
    "Sebastian_love_Text": "Here @^^ I'm kinda bored staying at home, do you want to come visit me or something? I don't want to go out at all, Demi is still inside the lab on the ground floor tinkering with his machines and I don't want to see his old face. ^^ To be honest, I feel more like family when I'm with you than I do when I'm with them. ^^ Sebastian",
    "Sebastian_l1_Text": "Here @^^ I found a lovely frog on the edge of Mountain Lake. ^^ It may not sound like anything special, but I did find a cute frog. ^^Sebastian",
    "Sebastian_l2_Text": "Here @^^ When I was little I always came to the tracks to watch the trains, out of childish curiosity it seemed. In those days Robin would still come out with me, but those days are gone. ^^ There were nothing but fallen leaves and fibrous grass, and occasionally a whistle would come from the far side of the tunnel, followed by a warble on the tracks - the crushing of sleepers and rails smelled of rust, and I wondered how much longer the age-old work would last. In the autumn, the tracks are mostly used by coal wagons, and occasionally a few trains with passengers pass by, and the people inside always look out over the valley with astonishment. Some of them would wave out of the window, and I would sometimes wave at them. I didn't know who they were greeting and I equally didn't know them, but maybe we all wanted to say goodbye to something. ^^Sebastian",
    "Sebastian_date_Text": "Here @^^ Thanks for the flowers, @, so that makes us official lovers. I'm so happy to be a couple with you. ^^ Oh yeah, Robin asked me too - I wasn't going to tell her, but she was surprisingly concerned about me. My relationship with Robin is also much better since you came into my life, as strange as that sounds, but thank you. ^^ Sebas",
    "Sebastian_d1_Text": "Here @^^ I found a frog in the pond the other day, it was just lying on a rock and looked as if it was sunbathing. ^^ I'm thinking of keeping frogs again, maybe I can prepare an ecotank. ^^ Sebas",
    "Sebastian_d2_Text": "To @^^^ Ah, @, I sent you a package just below the letter. ^^ My sister told me that if I wanted to show my liking for someone, I should try to start sending gifts to that person. I don't really understand it, but - anyway, I hope you like it. ^^ Sebas",
    "Sebastian_fd1_Text": "Give @^^ I don't really like the holidays in this town, but at least I get to see my friends at the luau. ^^ Most importantly, Robyn will be dancing with Demi so no one will be nagging me at the festival. ^^See you tomorrow, @. ^^ Sebas",
    "Sebastian_fd2_Text": "Here @^^ I'm here to invite you to the All Souls Festival tomorrow, the scary atmosphere and the monsters with their teeth and claws are kinda appealing to me. ^^ It's rumoured that Linus built that maze overnight - I always thought he was more than just a regular bum, he must have his own reasons for living that way. ^^See you tomorrow, @. ^^ Sebas",
    "Sebastian_e_Text": "To @^^^ Forgive me, @, I may have just responded to you a little too tamely, but that doesn't mean I don't love you. I'm honored to be your husband. ^^ Frankly, I don't have a clear answer to the question of how to be a good husband; after all, I don't have a single model to go by. But - and this is no excuse to avoid it - I will go ahead and talk to Demi about it, even if I don't like him. ^^ Well - there's one more important thing, can you accept me keeping frogs? It's okay if you can't. ^^ Sebas",
    "Sebastian_di_Text": "Here @^^ I've emptied my stuff, so if there's anything left behind just throw it away. ^^ I've thrown away the ecotank, as for where the frogs went, that's not your concern. ^^Sebastian",
    
    //Alex
    "Alex_c_title": "For good friend - Alex",
    "Alex_l_title": "For good friend-Alex",
    "Alex_d_title": "For my lover - Alex",
    "Alex_e_title": "For my lover - Alex",
    "Alex_di_title": "Letter from Alex",
    "Alex_crush_Text":"@^^You're a good friend, @. ^^ You make me feel like family, which is nice. ^^ I'm not very good at writing letters, so see you later. ^^Alex",
    "Alex_c1_Text":"@^^ Spring is a great opportunity to work out and I need to get back into shape after a lazy winter. ^^ Well, see you later. ^^Alex",
    "Alex_c2_Text":"@^^ Keep up the sweat in the summer, but hydrate at the same time. You must get a lot of exercise on the farm. ^^ Well, so, like I said above, hydrate. See you later. ^^Alex",
    "Alex_love_Text":"@^^^ You're getting better and better, I'm sure that @. ^^ You're going to be my best friend, not only because you're a good, kind person, but because you're as motivated as I am. ^^ Well, see you later. ^^Alex",
    "Alex_l1_Text":"@^^ I'm going to train on the beach today and it feels really good to sweat in the sun. ^^ Regular exercise allows me to stay fit and keep my original dream in mind in the hard work. ^^Alex",
    "Alex_l2_Text":"@^^ The autumn sun is much fiercer than expected, so remember to have some sunscreen. ^^ It's not the same thing as sunbathing, and getting burnt by UV rays is a serious matter. ^^Alex",
    "Alex_date_Text":"@^^ I expected this, the two of us do fit well together, of that I have complete certainty. Our future must be bright. ^^ I'm talking too much, we'll talk in person, @. ^^Alex",
    "Alex_d1_Text":"@^^If you ever want to meet me, come see me at the ice cream stand, I work there occasionally. ^^ People in this town don't buy much ice cream, which is both good and bad for me, not much income, but at least there's plenty of time for holidays. ^^Alex",
    "Alex_d2_Text":"@^^^ Hi, @, I'm writing to ask if it's a good time to plant leeks in the autumn. ^^ Here's the thing, Evelyn shopped all over town and couldn't get any leeks, so I just thought I'd try and see if I could grow some myself. ^^Alex",
    "Alex_fd1_Text":"@^^ Come be my dance partner at the Flower Dance Festival, @, I think you're the only one I'd like the most. ^^ I'm going to get a new haircut and be fully prepared to see you. ^^Alex",
    "Alex_fd2_Text":"@^^ Banquet day is one of the few days when I can not have to care about my energy intake. On this day I can temporarily reduce the intensity of my workouts, but even then I can't slack off. ^^ You shouldn't eat too much at the party either, long stretches of work plus overeating are hard on the body. ^^Alex",
    "Alex_fd3_Text":"@^^I don't know if you noticed, but there were free burgers in the north area of the show, all courtesy of Gus. ^^ That's what I came to say, see you at the festival. ^^Alex",
    "Alex_fd4_Text":"@^^ Tomorrow is the Winter Star Feast, don't forget to go to the feast, Evelyn and George are kinda looking forward to meeting you. ^^ It's still quite cold, don't forget to add clothes. ^^Alex",
    "Alex_e_Text":"@^^^ We're actually getting married, I can't even imagine this day, looks like I was right before, we do have a bright future ahead of us. ^^ I'm about to move to the farmhouse and I feel so happy, I just wonder if that will leave Evelyn and George feeling empty. ^^Alex",
    "Alex_di_Text":"@^^I suppose even I have times when my predictions go wrong and our married life isn't as perfect as I had expected. ^^ Of course, I'm still grateful to you, @. I think I'd be hard pressed to find a better partner, but it's not impossible after all. ^^ Alex",
    
    //Harvey
    "Harvey_c_title": "To my good partner - Harvey",
    "Harvey_l_title": "To my good partner - Harvey",
    "Harvey_d_title": "Give me my best lover - Harvey",
    "Harvey_e_title": "Give me my best lover - Harvey",
    "Harvey_di_title": "Letter from Harvey",
    "Harvey_crush_Text": "Thank you to my good partner @^^, @. The doctor's work is always so busy, and your help is very useful. ^^Although I am for people's health, to be honest, I am not very healthy myself. I often stay up late and get up early, and a lot of the time I don't eat normally, just pickles and fruit wine to make do with it – sorry, I'm a person who tends to get too far away when I speak. In short, thank you for your support and help to me. ^^Dr. Harvey",
    "Harvey_c1_Text": "To my good buddy @^^ I suggest you go out for a walk more in the spring, @. This season is best for humans to get in touch with nature – you don't have a pollen allergy, do you? If not, you can walk around the nearby valley. ^^ the air quality in Stardew Valley is very good, after all, there is no traffic or polluting industry nearby, and although everything here seems a little inconvenient, our bodies are always honest. To tell if a place has changed, just look at how our bodies rate it. ^^Dr. Harvey",
    "Harvey_c2_Text": "To my good partner @^^ The ultraviolet rays in summer are very strong, although in the eyes of most people it is just a little hotter than other seasons, but in fact, long-term work outside is easy to sunburn. ^^ UV is not visible, that doesn't mean it doesn't exist. If you've ever tried sunbathing without sunscreen, the sun will make you remember your poor choice this season! Your skin will fall off in small pieces in a clear, dry state, and the newly grown skin underneath – If you try to gently press the sunburn with your hand you can experience how painful it really is. ^^ almost forgot, I'm just here to remind you to use sunscreen, not sunbathe. ^^Dr. Harvey",
    "Harvey_love_Text": "To my good partner @^^@, thank you for your support. Though I've been busy with work, I've still enjoyed being able to catch up with you. ^^ you can try to monitor your bones and muscles for discomfort, after all, the most easily worn bones after long-term work are your bones. You should take a proper rest after the busy farm, or simply sleep, and don't care too much about the income of the farm, after all, life is only once, and no matter how much money is lost, it can be earned back. ^^Dr. Harvey",
    "Harvey_l1_Text": "To my good partner @ ^^, after the matter at hand, it is actually summer. I still want to remind you, don't forget to wear sunscreen and don't wear half-sleeved clothes because I've seen your arms get easily burned! ^^The people in this town are in such good health that I'm running out of money, but it's actually a good thing. I should consider selling over-the-counter drugs online or something, and the qualifications of professional doctors should attract customers. ^^Dr. Harvey",
    "Harvey_l2_Text": "To my good friend @^^ Autumn is my busiest time, after all, no one who is physically strong can guarantee that he will be able to survive this seasonal flu. People here rarely have tricky complications, so my injections are always piled up until they expire, while oral pills are often in short supply. ^^ you should maintain a habit of regular comprehensive physical examinations, @, which can help detect potential lesions early. Everyone has some defects, and these defects are likely to suddenly develop into diseases one day, which is the meaning of periodic medical examinations. ^^Dr. Harvey",
    "Harvey_date_Text": "Give me my best lover ^^This is really great news, @. I have been practicing medicine for many years and have been kind to countless patients, but it is the first time that someone has completely opened their hearts to me, thank you, @. ^^ a patient came knocking on the door, this letter will come here first, see you later, @. ^^Dr. Harvey",
    "Harvey_d1_Text": "Give me my best lover ^^I'm still thinking about whether to close the door early and go for a walk on the beach... I wanted to take a vacation, but there was no way, the doctor couldn't rest. ^^Maru, although she can help me with simple work, I would never dare to give her the work of diagnosis, she has no professional knowledge. ^^ such a thing as vacation, I can really only think about it casually in my head. ^^Dr. Harvey",
    "Harvey_d2_Text": "Give me my best lover ^^ There shouldn't be much to look forward to working outside in winter, right? If anything, I advise you not to stay in the snow for too long. Why do ^^ say that? First, if you don't wear gloves, prolonged contact with snow-covered tools will cause frostbite on your hands, and secondly, the road surface is slippery, and it is easy to fall if you are not careful. Take precautions and reduce unnecessary outings. ^^Dr. Harvey",
    "Harvey_fd1_Text": "Give me my best lover ^^@, do you want to be my dance partner at the Flower Dance Festival? I'm not very good at dancing, but I'm working hard. ^^ long hours of desk work have made my body a little stiff, and it is also a good choice to take advantage of this festival activity, and it is time to let go of the burden of daily work. ^^Dr. Harvey",
    "Harvey_fd2_Text": "Give me my best lover ^^ At tomorrow's festival, if nothing else, there should be mango sticky rice and precious pineapple wine, I can't wait. ^^ fact, this festival is basically not related to health, but it is not bad to come to such a celebration once a year, and spiritual happiness may make up for the loss of health. ^^Dr. Harvey",
    "Harvey_fd3_Text": "Give me my best lover ^^ Merry Christmas in advance, @. I live alone in Stardew Valley, and it's a little lonely to say, but the atmosphere of the feast is like being at home, and people are not disgusted with each other or alienated. ^^ look forward to seeing you at the festival, darling. ^^Dr. Harvey",
    "Harvey_e_Text": "Give me my best lover ^^ It's an honor to be your future husband, dear @. ^^I think I should be able to give myself some rest, I will change the doctor's diagnosis time from seven days a week to two days, and the rest of the time I will leave it to Maru, of course, we need to pay her more. ^^ look forward to our wonderful wedding. ^^Your Harvey",
    "Harvey_di_Text": "To @^^ I think we may have a bit of a big difference in personality, so it's normal that we can't get along. ^^ what saddens me the most is not the loss of you, but the fact that I will continue to live a seven-day lunch break, alas. ^^Dr. Harvey",

    //Sophia
    "Sophia_c_title": "For the little farmer - Sophia",
    "Sophia_l_title": "For the little farmer - Sophia",
    "Sophia_d_title": "For my little farmer - Sophia",
    "Sophia_e_title": "For my little farmer-Sophia",
    "Sophia_di_title": "Pelican Town West Farm Collection",
    "Sophia_crush_text": "To My Little Farmer @^^ Hi @, this is the first time I've written to you and I wonder if you like this *primitive* way of communicating? ^^ Although it would be easier to call, I prefer to express my feelings in writing, after all, calling makes me nervous - you understand. When I write a letter in peace, I have plenty of time to think about my wording and describe my feelings, and I don't have to worry about whether I'm going to make the other person gradually sulk by stammering. ^^ That's all I have to write about, our farms aren't too far away, so remember to visit me more often. ^^Sophia",
    "Sophia_c1_text": "To the little farmer @^^ It's a beautiful spring in Stardew Valley, with dandelions and yellow daffodils in full bloom all around the vineyards and the occasional pure white Stardew Valley snowdrop. ^^ Do you like walking in the valley,@? Scarlett always advises me to get out more, but I still don't really like going outside, especially with people, I feel like I don't really fit in with the world. I just have enough of you and Scarlett, everyone else is irrelevant. ^^ Actually I don't reject the people here, most of them are very friendly, it's just that kind of warmth I just can't handle. ^^ Sophia",
    "Sophia_c2_text": "For the little farmer@^^ I harvested so many grapes in the summer, they were sweet and full, round like pearls. If I didn't have to think about the winery's revenue, I'd freeze them all and make hockey pucks to eat - have you ever tried that? It's like eating a lollipop. ^^ The summer and autumn seasons are my busiest times, I have to harvest enough grapes so that I can keep the winery producing. In the winter, I stuff the grapes into barrels and leave the rest of the work to time, waiting for a long holiday with comic books and cartoons. ^^ Sophia",
    "Sophia_love_text": "For the little farmer @^^ Hey little fool, how was the harvest today? ^^ Even though I'm a fellow farmer, I'm still nowhere near as good as you when it comes to gardening, and I really admire you for being self-taught and going from being a completely inexperienced clerk to an old-fashioned farmer in that respect. ^^ But I think I'll catch up with you sooner or later, after all, we're best friends now, so please don't hesitate to give me advice next time we meet. ^^ Sophia",
    "Sophia_l1_text": "To the little farmer@^^This winery, these barrels and these racks were left to me by my parents and, along with my name Sophia, became the last thing I remember about them. I don't know why they gave me that name, perhaps they expected a brave, resolute daughter who would never fear her fate, like Sophia of Eastern Rome - but I am far from being that strong at heart. All I can do is to do my best to perpetuate the estate, to keep the name and the glory of Château de la Lune alive, and in this way I may be similar to the last princess. ^^ I don't know if that's too proud to say. Haha. ^^ Sophia",
    "Sophia_l2_text": "To the little farmer @^^ Is it cold on your farm in the winter time? The fires are burning brightly in the winery and you are welcome to come and visit me anytime. ^^ It's well heated and the rooms are baking hot except for the cellar. Can you believe I'm still wearing short-sleeved thin pyjamas at home? I'm going to get heatstroke from being around the fire. On a cold winter day like this, I should just lounge on the sofa with a comic, under my little blanket, without having to go out or do any farm work. ^^ After all, it's been a busy year, @, but farm owners rarely get such things as holidays. ^^ Sophia",
    "Sophia_date_text": "For my little fool ^^ I feel so lucky to be able to come along with you, @. ^^ I've basically never dealt with people much, growing up the only socializing I did besides talking to Scarlett was sending out wine lists. I was naive enough to think I could live with comics and cartoons for the rest of my life, having no concept of things like what it means to like and what kind of people I like. But since you've come into my life, I've gradually come to think in a new way. Thanks to you, my little fool, my first love is my lover, and that is a blessing that is precious. ^^ Please come and see me more often, I want to tell you everything that is in my heart. ^^ Your Sophia",
    "Sophia_d1_text": "For my little fool ^^I passed your farm on my walk this morning, the air was fresh and the scent of pollen was everywhere. ^^ Who left this farm to you? Your parents? Or was it your grandfather? I seem to have heard Lewis talk about it, but I can't remember. ^^ A long time ago there were four farmers in Stardew Valley, then the Aurora Vineyard inside the coal mine forest was suddenly abandoned for some reason, followed by the Blue Moon Winery which I inherited from my parents, and then Susan was stuck under the ruins - this was after the JOJA came here, and their arrival changed the valley My memory of Stardew Valley is blurred from this point on. It's a good thing that you came later and the land wasn't left on the shelf for too long. ^^ Your Sophia",
    "Sophia_d2_text": "For my little fool ^^ Hi my little fool, I'm dying of boredom at home, come and play with me. ^^ I don't like to go out in the summer, so I go back to my room and stay there every day after taking care of the vines, who makes it so hot here in the summer. When I'm in the house I like to keep the air conditioning on low and then wrap up in a blanket, it feels like swaddling a baby. ^^ Is that a bit naive to say? But I love that feeling. I'll share half the blanket with you if you'll come to me. ^^ Your Sophia",
    "Sophia_d3_text": "For my little fool ^^ I picked out some bunches of grapes for you to go over - I was going to send you wine, but then I was worried you didn't like wine. ^^ By common sense, you might think a winery owner would have a special fondness for wine, but in reality I wouldn't want to touch a drop of it if it wasn't to check the taste of the wine. I don't really understand people's preference for wine, but it's that preference that has brought me fame and a privileged life, and that's the only thing I like about wine. ^^ By the way, if you can't finish these grapes for a while, you can freeze them. ^^ Your Sophia",
    "Sophia_d4_text": "For my little fool ^^ The valley is surprisingly quiet in winter, and in the little woods near the winery you can even occasionally see hungry little owls chasing chipmunks from the branches. I often think that if I were to become one of those little creatures, I could explore this new and strange world without having to worry about the strange looks of humans. It's amazing to think that in a civilised society, carrying a blanket on the street attracts stares from passers-by. ^^ Your Sophia",
    "Sophia_fd1_text": "For my little fool ^^Seriously, @, I don't want to go to the Flower Dance Festival, I don't like dancing in a dress in front of so many people - but there's free cake to eat at the Festival. ^^ Actually, if you want to dance you can come to my house and we can dance the whole day and not have to care about other people's eyes. That was my intention, but I finally thought we'd better go to the festival - after all, everything has to be a first step and I can't always stay at home. ^^ Your Sophia",
    "Sophia_fd2_text": "For my little fool ^^ Hi little fool, I've got a bottle of aged wine for tomorrow's party. ^^ If you want to try it, remember to be on time for the feast. ^^ Your Sophia",
    "Sophia_fd3_text": "For my little fool ^^The revenue of the winery doesn't really require me to go around promoting it, but the fair is still a great opportunity to promote my wines to all kinds of visitors, even foreign ones. ^^ You should also take this opportunity to make a name for your farm so that we can make a lot of money in a short time later and then spend the rest of the time travelling or simply lying around the room on holiday, and I can take advantage of the rare time away to buy lots of new comic books and cassettes. ^^ Anyway, see you at the fair, little fool. ^^ Your Sophia",
    "sophia_fd4_text": "For my little fool ^^ Little fool! I've come to remind you that tomorrow is Christmas, have you forgotten? ^^ I've got a Christmas present for you, don't forget to come and see me sometime. I don't want verbal wishes, I just want to meet you now, @. ^^ Your Sophia",
    "Sophia_e_text": "For my little fool ^^ You've finally worked up the courage and are planning to marry me? You are such a little fool, in fact we didn't have to go through this process, it was enough for me to know that you loved me deeply and wanted me to be your wife. ^^ Where did you get this pendant? It is shaped like a conch shell, and when I put it to my ear, I can faintly hear the sound of the waves. I have an unspeakable longing for the jeweled sea, a feeling like a daughter facing her nurturing parents, a natural sense of dependence. For over a decade I clung to a life of self-reliance, the kind of life that made me remember my parents less and less, and the washout of memories made it painful - but now the pendant you gave me has brought back everything relevant. ^^ I am writing this letter to you from the sea of the Jewel Sea, where the sun is warm today and the waves are extraordinarily pleasant. ^^ Your Sophia",
    "Sophia_di_text": "To the farmer@^^ Sorry, @, it seems I'm still not ready for love. I simply can't be a good wife; after all, someone like me who can't even remember what my parents look like has no idea what a family should be like. ^^ I must have broken your heart,@, even though I know nothing about it, but my presence probably only brings embarrassment and sadness to those around me, so let me be alone. The fault is not yours,@, don't be too hard on yourself. ^^ How I wish now that I had died in that accident a dozen years ago, so that I would not have had to make your acquaintance. ^^Sophia",

    //Victor
    "Victor_c_title": "Letter to a farmer - Victor",
    "Victor_l_title": "Letter to a farmer - Victor",
    "Victor_d_title": "To my farmer - Victor",
    "Victor_e_title": "To my partner - Victor",
    "Victor_di_title": "Letter to a farmer-Victor",
    "Victor_crush_text": "To @^^^ I'm writing to someone for the first time, @. To be honest, I don't know why I suddenly got the idea of wanting to write and communicate with someone, but I put pen to paper anyway, perhaps because you are rather special in my eyes. ^^ Let me put it another way - @, what did you come to Stardew Valley for? It's common sense, for a normal person, that life in the city should be easier and more interesting than here, and that's what I think makes you special. ^^ You know better than I do what you like and what you want, and that must make life more meaningful. ^^ Victor",
    "Victor_love_text": "To @^^^Hi @, how are things going? ^^ One thing I discovered during my recent geological exploration work is that the river to the east of the quarry was a deep valley - no, that's probably not an accurate term, I should say a dry riverbed - not so long ago. I found signs of artificial blasting in the rock pile near the quarry, perhaps because JOJA's construction work had caused a landslide and the broken rocks had blocked the river like a natural dam. ^^The construction of dams, the blocking of rivers and man-made blasting and mining can all leave the potential for geological disasters, but it is impossible for man to develop without destroying the environment. ^^ Victor",
    "Victor_l1_text": "Here's something I've been thinking about lately - while people here are mostly content, if you look at it from the perspective of an infrastructure engineer, Pelican Town's infrastructure is completely substandard. Have you noticed that in a coastal town with such a dense network of water, there are only a handful of short bridges capable of carrying loads, and the small wooden bridges near the coal mine forest are completely insecure in terms of safety? When the rains come and the river rises, these little wooden bridges are a road to hell. ^^ Also, the roads in Pelican Town are completely unformed, which is one of my biggest concerns. People who live on the north and west sides of the town have to walk across a long stretch of loamy road every day, and the rock walls on either side of the road are completely exposed, meaning that a small landslide could cut them off completely from the town - I'm getting ahead of myself, I mean, this is probably the same situation around your farm, so you're on your own Be safe. ^^ Victor",
    "Victor_l2_text": "Give @^^^ In the winter time I'll find some books to read to pass the idle time. In cold weather, when building materials are less strong and the tundra is not suitable for building on, this is when most of the engineers at Grampden give themselves a break. Although I am still only an apprentice, learning to give myself a proper holiday should count towards my job skills. ^^ Is it cold in your farmhouse? If it is, you can come to my place, it's warm in the library. ^^ Victor",
    "Victor_date_text": "For me @^^ I had thought we might get together, but I didn't think it would come so suddenly, and I was wondering if I should go and confess my love to you when I'm done with my recent work - but you beat me to it in the end, haha. ^^ I'll tell Olivia about it sometime, I'm sure she'll be relieved to know we're together too. ^^ Victor",
    "Victor_d1_text": "For me @^^ Spring is a beautiful time of year, it's time for me to get out and digest the books I've been reading all winter. ^^This valley is truly a paradise, even a non-walker like me can't help but want to go out for a walk. Although there was nothing to do in the farmhouse for the whole winter, you don't want to spend too much time alone in the farmhouse or you'll get claustrophobic. ^^ Victor",
    "Victor_d2_text": "For me @^^ I'm always worried about you getting heatstroke, so I'm sending you some energy tonic water. Don't work too hard when you're doing your job, career is certainly important to a person, but nothing can be compared to health. ^^Victor",
    "Victor_d3_text": "Give me the @^^^ ah, I can smell the autumn cheese already, @. ^^ I read once that the barrels used for ageing also seem to work for air-drying cheeses, and cheeses that have been air-dried for a certain amount of time have a strong aroma. I've tried drying my own cheese in the cellar before, but I always mess up - as most people say about me, even when I know it all, as soon as I start putting it into practice I make countless mistakes. ^^ I'm not discouraged by this though, it's just because I'm inexperienced. ^^ Victor",
    "Victor_d4_text": "For my @^^ I will spend this winter researching the monsters of Stardew Valley - a topic that is new, deep, dangerous and unforgiving to the outside world, but I don't think freedom should be restricted if it's just academic research. ^^ As with the monster almanac I'm looking through, this is the only commercially available authorised work on monsters. I had thought that even if the law only touched on a few superficial points, the records must be somewhat reliable, but since I ventured into the mines and saw the monsters with my own eyes, I can no longer trust the descriptions in these baby publications. ^^ I want to write my own almanac of monsters, which would overturn all past research on monsters, and as incredible as it may sound, everything I have seen has given me reason to question it. If science is truly fact-focused, then all theories that don't fit the facts are airy buildings that will eventually collapse, and all I have to do now is kick those airy buildings in the roots. ^^ Victor",
    "Victor_fd1_text": "For me @^^ I don't usually care much for traditional festivals, but I'm intrigued by moonlight jellyfish and I want to document every move of this novel creature. ^^^ Investigation reports from previous years have convinced me that the appearance of this creature is inextricably linked to the moon, and that the naming of the moon jellyfish is not a mere literary expression, but a general description of habits. I am no longer sure that this conceptualisation can even be considered science anymore, but in a valley full of secrets, it doesn't matter. ^^See you at the festival,@. ^^Victor",
    "Victor_fd2_text": "The @^^^ New Year for me holds a special meaning for me, after all it is one of the few holidays where I can deepen my communication with my mother. I have so little communication with her that we have developed an inexplicable disconnect, clearly mother and son but more distant than friends. ^^ I want to see you at the festival too, @, I don't want you to be alone at the reunion festival. One can certainly get used to being alone, but no one likes being alone, and I couldn't be clearer about that. ^^ Victor",
    "Victor_e_text": "To my @^^ It is an honour to be your fiancé, my dear @. ^^ It's hard to imagine that not so long ago I was pondering the way forward, still dithering over life's choices, and in the blink of an eye I'm with you. Dear @, my life is so much clearer with you by my side. ^^ Victor",
    "Victor_di_text": "To @^^ No need to be sad, @, I was quite calm when I got the news. ^^ May you find the person who makes you happy. ^^Victor",

    //Olivia
    "Olivia_c_title": "For my best friend - Olivia",
    "Olivia_l_title": "For my best friend - Olivia",
    "Olivia_d_title": "For my dear - Olivia",
    "Olivia_e_title": "For my dear - Olivia",
    "Olivia_crush_text": "For my dear friend ^^ I ordered a batch of wines, @, and wondered if you would like the taste of them? ^^ Victor doesn't like wine, he always tells me that they interrupt his thought process, but in my opinion, wine tasting puts you in a good mood so you can get better at your work. But as far as Viktor's lack of alcohol consumption is concerned, I'm quite comfortable with him. ^^ Olivia",
    "Olivia_c1_text": "For my best friend ^^These strawberries are for you, @. ^^ Maybe your farm produces strawberries too, but these are the ones I ordered from the northern outback towns, and they will be different in taste than the strawberry varieties I ordered from Stardew Valley. Give them a try, @. ^^ Olivia",
    "Olivia_c2_text": "For my good friend ^^ I sent you some cheeses, these are from Gautreaux. Because of the war turmoil and the economic blockade from Fingir, many farmers in Gortello are eager to get rid of their mountains of artisan products and are offering very good prices. ^^ Olivia",
    "Olivia_love_text": "For my good friend ^^@, are things still going well on the farm? If you're as capable as you are, all that farm work shouldn't be a problem. ^^ I'm sending you some mead, which is made in a unique way and is more of a flavoured drink made from honey than a wine. ^^ Olivia",
    "Olivia_l1_text": "For my good friend ^^ I picked up two bottles of truffle oil for you, maybe you'll need it when you're cooking, @. ^^ Your farm is set up nicely by you, it's thriving everywhere, you're such a capable farmer, @. I wonder if you know my son Victor? I think you would get on well together, and as a mother I would like him to make some capable friends. ^^ Olivia",
    "Olivia_l2_text": "For my best friend ^^ I ordered some caviar from up north and it just arrived today. I sent some to you. ^^ The fishermen in the north would collect sturgeon roe in the autumn and put it in canning jars to cure it until winter when it could be used to make a delicious meal. In times of peace the fishermen were free to fish and the sale of good caviar was the mainstay of the economy, but the expropriation of the waterways by the war put them out of work. ^^ For the general population, there are never any winners in war. As a migrant from Gautreaux to Fingir, I have a deep understanding of this statement. ^^ Olivia",
    "Olivia_date_text": "For my dear ^^I planted the flowers you gave me in fresh water so that they might bloom for a while longer. ^^ This bouquet reminds me of the time when Edward was still around, when he gave me a bouquet like this to show me his love, so it seems that the etiquette of showing love in Stardew Valley is similar to ours. Since Edward's departure, I have focused all my energy on Victor, and every time I see him, I am reminded of my past with Edward. Now, Victor was coming into his own and it was time for me to reconsider my own feelings. ^^ No need to feel guilty about anything, dear@. Edward had asked me to find a reliable companion before he died and I firmly refused him at the time, yet now I believe that my happiness and well-being is what Edward really wanted. ^^Olivia",
    "Olivia_d1_text": "For my dear ^^ The spring here gives me a familiar feeling as if I were back in my home town. I've sent you a few bottles of freshly made fruit wine, this time by my own hands, try it. ^^ Olivia",
    "Olivia_d2_text": "For my dear ^^ I'm writing to remind you to take plenty of rest when you're working and not to wear yourself out. It's easy to strain your body with all the wind and sun you get from working on the farm. ^^I was thinking that if you felt tired you could come and stay with me and you wouldn't have to do this physical work any more - but obviously you prefer life on the farm and farming and tending the animals constitute your pleasures. ^^ Olivia",
    "Olivia_d3_text": "For my dear ^^ I bought some cheese from the ranch, and these are for you. The cheese in Stardew Valley tastes so much sweeter, I don't know if it's something to do with the water and the pasture, but to be honest since I first moved to Stardew Valley I can feel the unique magic of the place. It's the first time I've felt so peaceful. ^^ Olivia",
    "Olivia_d4_text": "For my dear ^^^@, do you ever miss your home town? Perhaps it's because your grandfather was a resident here that you find a sense of belonging in Stardew Valley, even if you never returned here since you were a child. In contrast, I often miss my hometown in Gautreaux, and I fear that the years of war will eventually turn everything I remember about it into history, and my friends and family far away into a number in history. ^^ I shouldn't say such unlucky things, @, but I still miss the peaceful times. After all, people start to like nostalgia when it's winter. ^^ Olivia",
    "Olivia_fd1_text": "For my dear ^^ I used to go to the Flower Dance Festival, but I mainly went to see Victor, who wasn't very sociable, so I was worried that he might become an old bachelor in the future. From what I've observed, he's gotten quite close to Sofia and I'm still glad he's found at least one friend of the opposite sex for himself. ^^ Do you know that girl? I think she's quite nice, except it's the first time I've met a shyer kid than Viktor, so let's hope things go further between the two of them. ^^ Olivia",
    "Olivia_fd2_text": "For my dear ^^ I kinda like these get-togethers, it's a chance for the people of the valley to bond. I'm going to bring some aged wine and cheese over, and don't forget to pick your ingredients well, it's a rare event. ^^ Olivia",
     "Olivia_fd3_text": "For my dear ^^^ The fair is tomorrow, @, and I wonder what you're planning to exhibit? You work so hard every day and I'm sure you'll place well. See you at the festival. ^^ Olivia",
     "Olivia_fd4_text": "For my darling ^^ Come up to our side of the family for this year's Winter Walk Feast, I'd love to see you integrated into our family - you don't have to worry about Victor's side of things, I've mentioned you to him long ago and he's happy to accept you as part of our family. ^^See you at the festival,@. ^^ Olivia",
     "Olivia_e_text": "For my darling ^^ When you brought the pendant to my hand, I thought of Edward, who had the same look of surprise all those years ago - when I was a young girl in my first love affair, and then Victor was so old. ^^ Right, I should get down to business, I'd love to be engaged to you,@. This gem is for you and I hope it will see us through to the future. ^^Olivia",
 
     //Claire
     "Claire_c_title": "For my good friend - Claire",
     "Claire_l_title": "For my good friend - Claire",
     "Claire_d_title": "For my good love - Claire",
     "Claire_e_title": "For my good love - Claire",
     "Claire_di_title": "Letter to a farmer-Claire",
     "Claire_crush_text": "To my good friend ^^ How are you doing? Sometimes I envy you, having a farm to run yourself. ^^ I wonder if being a farm owner means you don't have to get up at 8am every morning to catch the bus? That would be great, I've dreamed of a life like that, the same old job is always boring. ^^ I'm not very good at writing letters,@, sorry. ^^Claire",
     "Claire_c1_text": "To my good friend ^^ I always see your farm when I pass the bus stop, but every time I just glance haphazardly at the outskirts and rarely get the chance to stop. ^^ I've always thought Stardew Valley was a beautiful place. I longed to get in touch with nature, but was tied to such a regular job, which made me incredibly melancholy. ^^Claire",
     "Claire_c2_text": "To my good friend ^^ Autumn seems to be a season of consumption, and every now and then my work becomes busier than usual. As I hurry past the bus stop I can smell the wild plums and hazelnuts wafting through the air and they give birth to the idea of stepping out into the countryside. ^^Claire",
     "Claire_love_text": "To my good friend ^^^ You're my best friend, @, just like my colleague Martin. ^^ Well - that's actually what I wanted to say in this letter, but it still feels a bit thin if that's all I write. Why don't you come back to my house one day if you're free, I have a lot of things I'd like to meet and talk to you about. ^^Claire",
     "Claire_l1_text": "To my good friend ^^^@, how are you doing? I hope you're enjoying life on the farm. ^^ It should be great to go to the beach in the summer, but with work getting in the way, something like that is probably just something to think about. Even if I did have a holiday like that, I probably wouldn't be able to find anyone who would want to go with me. I'm not very popular, I'm aware of that. ^^ Claire",
     "Claire_l2_text": "To my good friend ^^ It's so cold here, I'd love to stay under the covers all day and not go out. Don't forget to put extra clothes on yourself on your farm or you'll catch a cold. ^^ I had a hot cup of coffee before I left home - I've almost forgotten how many cases of instant coffee this is, JOJA's work always leaves me no time to improve my life. I do occasionally think about making my own coffee, and it would be nice to have time to make my own breakfast again, but that's all I can think about in the end. ^^Claire",
     "Claire_date_text": "To my wonderful love ^^^ I love you, @! I can finally say that now with no hard feelings, and you don't even know the times I've almost let that slip when we've been together. I actually thought about just being best friends with you for the rest of my life, so that as long as I always see you, I have nothing to regret in life, but I was worried that you'd meet someone else and I'd have less chance to see you that way. ^^ I've said too much - I shouldn't worry about that now, dear@. ^^Your Claire",
     "Claire_d1_text": "To my good love ^^ I saw a yellow daffodil near the bus stop and I thought I'd pick it for you. It still has a good amount of dew on it, but it's still pretty. ^^ I passed by your farm once again, it's so beautiful in there, I wonder if I'll ever get a chance to walk in? ^^ Your Claire",
     "Claire_d2_text": "To my good love ^^ Every season makes you want to eat some melons to beat the heat, I still think I should be inside a cold room on a day like this, but unfortunately I actually have to go to work, ugh. ^^ I bet the summers on the farm are hard too, not only is there no air conditioning, but I have to work on the crops in the hot sun, just thinking about it makes my skin start to ache. I wish you had someone to do some work for you. ^^ Your Claire",
     "Claire_d3_text": "To my good love ^^ I've heard that this is the busiest time of year for farmers, so don't let the farm work wear you out. ^^ I can already smell the maple syrup coming on the wind, the smell makes me miss caramelised fish, and I'd like to find time to cook myself a proper meal again, after all the years of frozen food have upset my gut. If only you could come to my house, then no matter how tired I am from work, I would love to cook you a meal like that. ^^ Your Claire",
     "Claire_d4_text": "To my good love ^^ Last night, on my way home, I looked away and saw a bright and dazzling star. It was twinkling and hanging alone in the night sky with eyes that never close. I don't know if this star is the Winter Star that the people of Pelican Town refer to, except that it seemed to have some kind of magic that drew me to live by its guidance - or maybe it was my inner guidance. ^^ Dear @, will you make me your wife? I am so deeply in love with you and although we see each other a lot, that is not enough. I never thought I would actually become so greedy one day, but my heart is filled with sadness every time we part. I know we may see each other soon, but I don't want to wait - what if one day you suddenly disappeared and disappeared? I know it's impossible, but if we can't stay together right away, forever, even if it's just a vain fantasy, there's no way I can convince myself. ^^ Love you Claire",
     "Claire_fd1_text": "To my wonderful love ^^ Dear! Will you dance with me tomorrow? I've been practicing my dance steps for this ball for ages just so I could dance with you. I want to be able to hold your hand at the festival so that everyone will know that we are made for each other. ^^ Your Claire",
     "Claire_fd2_text": "To my wonderful love ^^ I'm really looking forward to the feast tomorrow, I wonder if the Baileys soup will still be as delicious as in previous years? I'm planning to bring some grapes and berries over, they won't go down well but they'll be nice as a festive snack. I hope you'll be at the feast too, so I can see you then. ^^ Your Claire",
     "Claire_fd3_text": "To my good love ^^ I'm a bit scared of the monsters at All Souls' Day, but the pumpkin soup and pomegranate wine were great and the decorations at the festival were a novelty. ^^ I wonder what's in the All Souls' Day maze? Have you ever been inside? Just listening to the spooky noises from outside makes me tremble a little. ^^ Your Claire",
     "Claire_fd4_text": "To my good love ^^In past years I have always been alone at the feast, and although the food is delicious and the winter star trees are beautiful, no one likes to be alone at a festival of merriment. ^^ Will you come to the feast too? I would be relieved if you could be by my side. ^^Your Claire",
     "Claire_e_text": "To my good love ^^I would love to be at your farmhouse right now if I didn't have to work today. From the moment you said you wanted to be engaged to me, I've been longing for our life together, maybe we'll even be parents later? ^^ I know there's no rush yet, but I really can't wait to spend time with you. ^^ Your Claire",
     "Claire_di_text": "Letter to @^^I don't know-@, I don't know why we've come to this, when I still love you so much. ^^ But you want to separate from me, is that it? I see, @, maybe I'm so bad at expressing myself that I've made you doubt my feelings. If that's the case, I'm sorry, @. I can't get over anything to do with you at all, but I don't want to see you anymore because it would break my heart. ^^ Clare",

     //Wizard
     "Wizard_c_title": "Letter to the Apprentice of Magic",
     "Wizard_l_title": "Letter to the Apprentice of Magic",
     "Wizard_d_title": "Letter to the Apprentice of Magic",
     "Wizard_e_title": "Letter to a loved one",
     "Wizard_crush_text": "To the apprentice @^^ of the people I pointed out, although you are not the smartest, you are still one of the few who can see Zhu Nimo. So I guess something should be clarified with you, @. ^^Have you ever wondered why you never saw these elves before you came to Stardew Valley? Maybe in your eyes, it was my potion that gave you a certain ability, but the potion can't change everything, and your innate constitution is the root of all this. In the obscurantist past, people pinned their hopes on unwavering beliefs, expecting gods and nymphs to help them solve their difficulties, but as human research and development of the laws of nature, people with technological creations began to despise these beliefs—dry ice and meteorological instruments replaced precipitation totems, and construction machinery and architects replaced Zunimo. It is indeed admirable to rely on one's own spirit, but because of this, the elves gradually began to distance themselves from and be hostile to humans. ^^ I'm talking a little too much – in short, you can't see Zhu Nimo before because they have long abandoned the civilized world full of noise and pollution. I've seen the dwarves' carefully constructed world disappear in an instant, and I wonder if humans will follow in their footsteps. ^^Magnus",
     "Wizard_c1_text": "To the apprentice @ ^^ spring is a good opportunity to get in touch with the elements, you can try to go to the mountains and forests outside the town to get a closer look, the energy that has been dormant all winter will concentrate in the recent period. ^^ may not be attractive to say this, @, so I'll put it another way - the more concentrated the energy, the faster everything will grow, and the corresponding foraging food such as yellow narcissus and wild wasabi will increase. I wish the Nemors love these natural resources, and if you want to show kindness to them, consider collecting some as a gift. That's all ^^That's all I have to say, @. You know, you are like a baby in the realm of magic, you can't walk yet, you can only grope yourself in crawling. If you want to learn more about magic, don't overlook the opportunities that lie ahead. ^^Magnus",
     "Wizard_c2_text": "To apprentice @^^ I'm just here to make sure you haven't wasted your intellectual curiosity, @. ^^By the way, I would also like to remind you that each crop has its own unique energy, and therefore takes on different shapes and colors, such as snow yam absorbing the cold energy of winter, and is similar to snow crystals in appearance. The closest of all crops to the initial energy source of Stardew Valley is star fruit, which resembles the winter star in shape, but unfortunately does not match in color. ^^ the energy of the winter star affects the land and water of Stardew Valley, and this influence also affects the vegetation, animals, ore and even the townspeople in the valley. Let me give you a simple example, you can try putting crops with different energies in a sewing machine and see how it yields. ^^That's all I can say. ^^Magnus",
     "Wizard_c3_text": "To the Apprentice @ ^^There is a small river south of the tower that is where I go out for a walk at night. ^^I could feel that there were a lot of special substances in that river, and they made me feel like some kind of ore—maybe iridium ore or radioactive ore, I'm not sure. Topographically, the river should have originated in the mountains north of Pelican Town, so my guess is that the autumn flood washed these minerals downstream of the river. ^^If there are more samples to study, the cause of the mine abnormality may be revealed sooner. ^^Magnus",
     "Wizard_love_text": "It's rewarding to apprentice @^^ see you grow, @. Although I have not received any permission, in light of the progress you have made that cannot be ignored, and in order to avoid the risks of concealing the facts from an unregistered magic apprentice, I think it is necessary to give you a deep understanding of what is going on with magic. ^^ magic is a complex, mysterious, powerful, and dangerous force, the main source of which is a meteorite with a high content of iridium, which landed on Pangea with a massive meteor shower about hundreds of millions of years ago. The first humans to contact the power of magic were stargazers and soothsayers, and after a long period of observation and research, individual gifted people began to master and skillfully use the power of these aliens, and the documentary records of these people became the original for magical research. I can give you a simple example - the working mechanism of the teleportation tower is the process of destroying and recreating the teleportation modeled on the annihilation and birth of the star cluster, which means that each teleportation will make the user disappear, and then create an original user in the target location, doesn't it sound a little scary? But I can guarantee that the process is absolutely safe. ^^ maybe you have this question, since magic is closely related to stars, why are you now exposed to potions that are difficult to swallow? In fact, this is a relatively primitive way to test the qualifications of apprentices, the potion I gave you contains a lot of iridium elements, if you have the relevant qualifications, through this potion you can go on the magic road, do not need to spend decades like ancient stargazers to track the life cycle of the stars. Making good use of potions can save latecomers from taking many detours. ^^ one more question left to you - is the person who was destroyed and recreated by the teleportation tower, or is it not the same person he was? ^^Magnus",
     "Wizard_l1_text": "To apprentice @^^ things should be fine lately, @. ^^In addition to investigating the abnormalities in the mine, I am most interested in Zhu Nimo from the spirit world. This group of little things have refused to communicate with me for some reason, and I have made many attempts, but these attempts have all failed. But you are different, @, your physique seems to be very special, and Zhu Nimo is also very interested in you. So I hope you can bring me more information about Zunimo, whose abilities are of interest to the Ministry of Magic. ^^Magnus",
     "Wizard_l2_text": "To the apprentice @^^ I received your report, @, the section about Zhu Nimo is very well written. It will take me a while to confirm the referency of this report, and the attached package is to thank you for your help with Fengel's Ministry of Magic. ^^Magnus",
     "Wizard_l3_text": "To the apprentice @ ^^ the exhibition the other day was really lively, it seems that Vervik has made a lot of money again, I really don't know why people are so interested in divination. ^^ take this opportunity to tell you about divination, which is a type of magic that relies on divination balls. Perhaps in most literary records, divination balls are mostly crystal balls or gemstone beads, but in fact, the divination balls that can really be used to divinate the future are made of pure iridium wrapped in multicolored fragments. Its principle is to use multicolored fragments to drive large chunks of pure iridium to resonate with the tiny iridium element in the observed person's body to detect the fortune of the observee, which means that this divination is only effective for those who have access to iridium. ^^ divination never decides anything, and anything you do now and next has the potential to change the direction of the future, which is why divination is completely unappealing to me. I don't know why Velvik was so happy. ^^Magnus",
     "Wizard_date_text": "To my student @^^ I received a bouquet of magic apprentices - I don't actually know if it's proper to do this, @, but my heart doesn't seem to be going to refuse your affection. ^^ principle, a registered magician of the Fengel Ministry of Magic should not fall in love or marriage, because intimacy can make a person let down his guard, but since you are also a specially authorized apprentice of the Ministry of Magic, this principle may not apply. However, in terms of relationships, I still like to be called a teacher and a student, after all, I haven't been involved in love for a long time. ^^Magnus",
     "Wizard_d1_text": "To my student @^^ I thought about it, in fact, I can also write to you about magic. ^^ you've probably seen the statues used to curse people at my ex-wife's house, and they have nothing to do with star magic. They were sacrificial spells of the ancient races that once inhabited this land, with the barbaric colors of sacrifice and curse, and were therefore sealed by me in the swamp hut. If someone accidentally touches the power of those statues, God knows what will happen. ^^ sometimes, human beings should curb their greedy curiosity in order to avoid contact with esoteric and dangerous things. ^^Magnus",
     "Wizard_d2_text": "To my students @^^ I checked your crops, @, thank you for giving me the privilege of using them as research samples, I just want to know how iridium acts on soil and water. ^^These earth crystals are given to you, they are not difficult to control spars, and they should come in handy for farm matters. ^^Magnus",
     "Wizard_afterMogan_text": "To my student @^^ as you may have noticed, Morgan's kid has unique qualifications. ^^I haven't received an offer from the Ministry of Magic in a long time, especially after my ex-wife and I made a big mistake. The fact that they were able to send this child to me this time shows that they must have found something unique in this child, perhaps related to the appearance of the Void Shard. ^^Of course, I actually have a very bad conjecture - the Ministry of Magic made an exception to secretly send an apprentice to Stardew Valley, perhaps the power of the void has reached a very dangerous level. ^^Magnus",
     "Wizard_e_text": "Asking my lover @^^ to live in a student's home really makes me feel a little overwhelmed. It doesn't hurt ^^, as long as your enthusiasm for learning does not wane, I am also willing to be with you. I just hope you don't dislike the taste of potions and alchemy machines. ^^Magnus"
    }